zephyrproject-rtos/zephyr/ext/hal/ti/simplelink/source/ti/devices/cc13x2_cc26x2/inc/hw_rfc_ullram.h
/******************************************************************************
*  Filename:       hw_rfc_ullram_h
*  Revised:        2018-05-14 12:24:52 +0200 (Mon, 14 May 2018)
*  Revision:       51990
*
* Copyright (c) 2015 - 2017, Texas Instruments Incorporated
* All rights reserved.
*
* Redistribution and use in source and binary forms, with or without
* modification, are permitted provided that the following conditions are met:
*
* 1) Redistributions of source code must retain the above copyright notice,
*    this list of conditions and the following disclaimer.
*
* 2) Redistributions in binary form must reproduce the above copyright notice,
*    this list of conditions and the following disclaimer in the documentation
*    and/or other materials provided with the distribution.
*
* 3) Neither the name of the ORGANIZATION nor the names of its contributors may
*    be used to endorse or promote products derived from this software without
*    specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
* AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
* IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
* ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE
* LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
* CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
* SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
* CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
* ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
* POSSIBILITY OF SUCH DAMAGE.
*
******************************************************************************/

#ifndef __HW_RFC_ULLRAM_H__
#define __HW_RFC_ULLRAM_H__

//*****************************************************************************
//
// This section defines the register offsets of
// RFC_ULLRAM component
//
//*****************************************************************************
// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK10                                         0x00000000

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11                                         0x00000004

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK12                                         0x00000008

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK13                                         0x0000000C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK14                                         0x00000010

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK15                                         0x00000014

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK16                                         0x00000018

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK17                                         0x0000001C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK18                                         0x00000020

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK19                                         0x00000024

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK110                                        0x00000028

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK111                                        0x0000002C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK112                                        0x00000030

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK113                                        0x00000034

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK114                                        0x00000038

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK115                                        0x0000003C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK116                                        0x00000040

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK117                                        0x00000044

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK118                                        0x00000048

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK119                                        0x0000004C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK120                                        0x00000050

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK121                                        0x00000054

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK122                                        0x00000058

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK123                                        0x0000005C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK124                                        0x00000060

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK125                                        0x00000064

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK126                                        0x00000068

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK127                                        0x0000006C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK128                                        0x00000070

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK129                                        0x00000074

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK130                                        0x00000078

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK131                                        0x0000007C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK132                                        0x00000080

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK133                                        0x00000084

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK134                                        0x00000088

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK135                                        0x0000008C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK136                                        0x00000090

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK137                                        0x00000094

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK138                                        0x00000098

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK139                                        0x0000009C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK140                                        0x000000A0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK141                                        0x000000A4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK142                                        0x000000A8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK143                                        0x000000AC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK144                                        0x000000B0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK145                                        0x000000B4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK146                                        0x000000B8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK147                                        0x000000BC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK148                                        0x000000C0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK149                                        0x000000C4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK150                                        0x000000C8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK151                                        0x000000CC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK152                                        0x000000D0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK153                                        0x000000D4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK154                                        0x000000D8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK155                                        0x000000DC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK156                                        0x000000E0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK157                                        0x000000E4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK158                                        0x000000E8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK159                                        0x000000EC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK160                                        0x000000F0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK161                                        0x000000F4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK162                                        0x000000F8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK163                                        0x000000FC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK164                                        0x00000100

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK165                                        0x00000104

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK166                                        0x00000108

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK167                                        0x0000010C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK168                                        0x00000110

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK169                                        0x00000114

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK170                                        0x00000118

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK171                                        0x0000011C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK172                                        0x00000120

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK173                                        0x00000124

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK174                                        0x00000128

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK175                                        0x0000012C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK176                                        0x00000130

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK177                                        0x00000134

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK178                                        0x00000138

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK179                                        0x0000013C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK180                                        0x00000140

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK181                                        0x00000144

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK182                                        0x00000148

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK183                                        0x0000014C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK184                                        0x00000150

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK185                                        0x00000154

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK186                                        0x00000158

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK187                                        0x0000015C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK188                                        0x00000160

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK189                                        0x00000164

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK190                                        0x00000168

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK191                                        0x0000016C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK192                                        0x00000170

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK193                                        0x00000174

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK194                                        0x00000178

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK195                                        0x0000017C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK196                                        0x00000180

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK197                                        0x00000184

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK198                                        0x00000188

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK199                                        0x0000018C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1100                                       0x00000190

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1101                                       0x00000194

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1102                                       0x00000198

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1103                                       0x0000019C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1104                                       0x000001A0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1105                                       0x000001A4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1106                                       0x000001A8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1107                                       0x000001AC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1108                                       0x000001B0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1109                                       0x000001B4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1110                                       0x000001B8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1111                                       0x000001BC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1112                                       0x000001C0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1113                                       0x000001C4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1114                                       0x000001C8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1115                                       0x000001CC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1116                                       0x000001D0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1117                                       0x000001D4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1118                                       0x000001D8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1119                                       0x000001DC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1120                                       0x000001E0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1121                                       0x000001E4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1122                                       0x000001E8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1123                                       0x000001EC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1124                                       0x000001F0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1125                                       0x000001F4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1126                                       0x000001F8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1127                                       0x000001FC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1128                                       0x00000200

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1129                                       0x00000204

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1130                                       0x00000208

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1131                                       0x0000020C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1132                                       0x00000210

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1133                                       0x00000214

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1134                                       0x00000218

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1135                                       0x0000021C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1136                                       0x00000220

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1137                                       0x00000224

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1138                                       0x00000228

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1139                                       0x0000022C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1140                                       0x00000230

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1141                                       0x00000234

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1142                                       0x00000238

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1143                                       0x0000023C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1144                                       0x00000240

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1145                                       0x00000244

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1146                                       0x00000248

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1147                                       0x0000024C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1148                                       0x00000250

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1149                                       0x00000254

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1150                                       0x00000258

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1151                                       0x0000025C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1152                                       0x00000260

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1153                                       0x00000264

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1154                                       0x00000268

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1155                                       0x0000026C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1156                                       0x00000270

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1157                                       0x00000274

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1158                                       0x00000278

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1159                                       0x0000027C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1160                                       0x00000280

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1161                                       0x00000284

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1162                                       0x00000288

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1163                                       0x0000028C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1164                                       0x00000290

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1165                                       0x00000294

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1166                                       0x00000298

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1167                                       0x0000029C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1168                                       0x000002A0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1169                                       0x000002A4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1170                                       0x000002A8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1171                                       0x000002AC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1172                                       0x000002B0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1173                                       0x000002B4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1174                                       0x000002B8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1175                                       0x000002BC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1176                                       0x000002C0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1177                                       0x000002C4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1178                                       0x000002C8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1179                                       0x000002CC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1180                                       0x000002D0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1181                                       0x000002D4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1182                                       0x000002D8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1183                                       0x000002DC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1184                                       0x000002E0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1185                                       0x000002E4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1186                                       0x000002E8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1187                                       0x000002EC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1188                                       0x000002F0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1189                                       0x000002F4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1190                                       0x000002F8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1191                                       0x000002FC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1192                                       0x00000300

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1193                                       0x00000304

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1194                                       0x00000308

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1195                                       0x0000030C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1196                                       0x00000310

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1197                                       0x00000314

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1198                                       0x00000318

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1199                                       0x0000031C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1200                                       0x00000320

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1201                                       0x00000324

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1202                                       0x00000328

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1203                                       0x0000032C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1204                                       0x00000330

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1205                                       0x00000334

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1206                                       0x00000338

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1207                                       0x0000033C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1208                                       0x00000340

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1209                                       0x00000344

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1210                                       0x00000348

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1211                                       0x0000034C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1212                                       0x00000350

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1213                                       0x00000354

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1214                                       0x00000358

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1215                                       0x0000035C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1216                                       0x00000360

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1217                                       0x00000364

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1218                                       0x00000368

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1219                                       0x0000036C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1220                                       0x00000370

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1221                                       0x00000374

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1222                                       0x00000378

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1223                                       0x0000037C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1224                                       0x00000380

