zephyrproject-rtos/zephyr/ext/hal/ti/simplelink/source/ti/devices/cc13x2_cc26x2/inc/hw_rfc_ullram.h
// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1472                                       0x00000760

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1473                                       0x00000764

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1474                                       0x00000768

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1475                                       0x0000076C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1476                                       0x00000770

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1477                                       0x00000774

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1478                                       0x00000778

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1479                                       0x0000077C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1480                                       0x00000780

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1481                                       0x00000784

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1482                                       0x00000788

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1483                                       0x0000078C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1484                                       0x00000790

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1485                                       0x00000794

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1486                                       0x00000798

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1487                                       0x0000079C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1488                                       0x000007A0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1489                                       0x000007A4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1490                                       0x000007A8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1491                                       0x000007AC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1492                                       0x000007B0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1493                                       0x000007B4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1494                                       0x000007B8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1495                                       0x000007BC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1496                                       0x000007C0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1497                                       0x000007C4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1498                                       0x000007C8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1499                                       0x000007CC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1500                                       0x000007D0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1501                                       0x000007D4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1502                                       0x000007D8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1503                                       0x000007DC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1504                                       0x000007E0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1505                                       0x000007E4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1506                                       0x000007E8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1507                                       0x000007EC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1508                                       0x000007F0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1509                                       0x000007F4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1510                                       0x000007F8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1511                                       0x000007FC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1512                                       0x00000800

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1513                                       0x00000804

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1514                                       0x00000808

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1515                                       0x0000080C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1516                                       0x00000810

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1517                                       0x00000814

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1518                                       0x00000818

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1519                                       0x0000081C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1520                                       0x00000820

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1521                                       0x00000824

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1522                                       0x00000828

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1523                                       0x0000082C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1524                                       0x00000830

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1525                                       0x00000834

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1526                                       0x00000838

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1527                                       0x0000083C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1528                                       0x00000840

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1529                                       0x00000844

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1530                                       0x00000848

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1531                                       0x0000084C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1532                                       0x00000850

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1533                                       0x00000854

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1534                                       0x00000858

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1535                                       0x0000085C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1536                                       0x00000860

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1537                                       0x00000864

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1538                                       0x00000868

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1539                                       0x0000086C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1540                                       0x00000870

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1541                                       0x00000874

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1542                                       0x00000878

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1543                                       0x0000087C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1544                                       0x00000880

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1545                                       0x00000884

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1546                                       0x00000888

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1547                                       0x0000088C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1548                                       0x00000890

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1549                                       0x00000894

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1550                                       0x00000898

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1551                                       0x0000089C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1552                                       0x000008A0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1553                                       0x000008A4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1554                                       0x000008A8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1555                                       0x000008AC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1556                                       0x000008B0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1557                                       0x000008B4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1558                                       0x000008B8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1559                                       0x000008BC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1560                                       0x000008C0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1561                                       0x000008C4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1562                                       0x000008C8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1563                                       0x000008CC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1564                                       0x000008D0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1565                                       0x000008D4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1566                                       0x000008D8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1567                                       0x000008DC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1568                                       0x000008E0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1569                                       0x000008E4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1570                                       0x000008E8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1571                                       0x000008EC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1572                                       0x000008F0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1573                                       0x000008F4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1574                                       0x000008F8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1575                                       0x000008FC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1576                                       0x00000900

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1577                                       0x00000904

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1578                                       0x00000908

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1579                                       0x0000090C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1580                                       0x00000910

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1581                                       0x00000914

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1582                                       0x00000918

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1583                                       0x0000091C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1584                                       0x00000920

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1585                                       0x00000924

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1586                                       0x00000928

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1587                                       0x0000092C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1588                                       0x00000930

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1589                                       0x00000934

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1590                                       0x00000938

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1591                                       0x0000093C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1592                                       0x00000940

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1593                                       0x00000944

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1594                                       0x00000948

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1595                                       0x0000094C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1596                                       0x00000950

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1597                                       0x00000954

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1598                                       0x00000958

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1599                                       0x0000095C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1600                                       0x00000960

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1601                                       0x00000964

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1602                                       0x00000968

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1603                                       0x0000096C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1604                                       0x00000970

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1605                                       0x00000974

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1606                                       0x00000978

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1607                                       0x0000097C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1608                                       0x00000980

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1609                                       0x00000984

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1610                                       0x00000988

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1611                                       0x0000098C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1612                                       0x00000990

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1613                                       0x00000994

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1614                                       0x00000998

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1615                                       0x0000099C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1616                                       0x000009A0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1617                                       0x000009A4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1618                                       0x000009A8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1619                                       0x000009AC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1620                                       0x000009B0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1621                                       0x000009B4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1622                                       0x000009B8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1623                                       0x000009BC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1624                                       0x000009C0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1625                                       0x000009C4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1626                                       0x000009C8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1627                                       0x000009CC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1628                                       0x000009D0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1629                                       0x000009D4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1630                                       0x000009D8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1631                                       0x000009DC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1632                                       0x000009E0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1633                                       0x000009E4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1634                                       0x000009E8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1635                                       0x000009EC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1636                                       0x000009F0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1637                                       0x000009F4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1638                                       0x000009F8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1639                                       0x000009FC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1640                                       0x00000A00

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1641                                       0x00000A04

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1642                                       0x00000A08

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1643                                       0x00000A0C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1644                                       0x00000A10

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1645                                       0x00000A14

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1646                                       0x00000A18

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1647                                       0x00000A1C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1648                                       0x00000A20

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1649                                       0x00000A24

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1650                                       0x00000A28

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1651                                       0x00000A2C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1652                                       0x00000A30

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1653                                       0x00000A34

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1654                                       0x00000A38

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1655                                       0x00000A3C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1656                                       0x00000A40

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1657                                       0x00000A44

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1658                                       0x00000A48

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1659                                       0x00000A4C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1660                                       0x00000A50

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1661                                       0x00000A54

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1662                                       0x00000A58

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1663                                       0x00000A5C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1664                                       0x00000A60

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1665                                       0x00000A64

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1666                                       0x00000A68

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1667                                       0x00000A6C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1668                                       0x00000A70

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1669                                       0x00000A74

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1670                                       0x00000A78

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1671                                       0x00000A7C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1672                                       0x00000A80

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1673                                       0x00000A84

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1674                                       0x00000A88

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1675                                       0x00000A8C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1676                                       0x00000A90

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1677                                       0x00000A94

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1678                                       0x00000A98

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1679                                       0x00000A9C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1680                                       0x00000AA0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1681                                       0x00000AA4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1682                                       0x00000AA8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1683                                       0x00000AAC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1684                                       0x00000AB0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1685                                       0x00000AB4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1686                                       0x00000AB8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1687                                       0x00000ABC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1688                                       0x00000AC0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1689                                       0x00000AC4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1690                                       0x00000AC8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1691                                       0x00000ACC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1692                                       0x00000AD0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1693                                       0x00000AD4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1694                                       0x00000AD8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1695                                       0x00000ADC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1696                                       0x00000AE0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1697                                       0x00000AE4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1698                                       0x00000AE8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1699                                       0x00000AEC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1700                                       0x00000AF0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1701                                       0x00000AF4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1702                                       0x00000AF8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1703                                       0x00000AFC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1704                                       0x00000B00

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1705                                       0x00000B04

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1706                                       0x00000B08

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1707                                       0x00000B0C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1708                                       0x00000B10

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1709                                       0x00000B14

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1710                                       0x00000B18

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1711                                       0x00000B1C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1712                                       0x00000B20

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1713                                       0x00000B24

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1714                                       0x00000B28

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1715                                       0x00000B2C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1716                                       0x00000B30

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1717                                       0x00000B34

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1718                                       0x00000B38

