zephyrproject-rtos/zephyr/ext/hal/ti/simplelink/source/ti/devices/cc13x2_cc26x2/inc/hw_rfc_ullram.h
// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1719                                       0x00000B3C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1720                                       0x00000B40

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1721                                       0x00000B44

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1722                                       0x00000B48

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1723                                       0x00000B4C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1724                                       0x00000B50

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1725                                       0x00000B54

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1726                                       0x00000B58

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1727                                       0x00000B5C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1728                                       0x00000B60

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1729                                       0x00000B64

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1730                                       0x00000B68

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1731                                       0x00000B6C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1732                                       0x00000B70

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1733                                       0x00000B74

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1734                                       0x00000B78

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1735                                       0x00000B7C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1736                                       0x00000B80

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1737                                       0x00000B84

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1738                                       0x00000B88

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1739                                       0x00000B8C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1740                                       0x00000B90

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1741                                       0x00000B94

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1742                                       0x00000B98

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1743                                       0x00000B9C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1744                                       0x00000BA0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1745                                       0x00000BA4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1746                                       0x00000BA8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1747                                       0x00000BAC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1748                                       0x00000BB0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1749                                       0x00000BB4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1750                                       0x00000BB8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1751                                       0x00000BBC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1752                                       0x00000BC0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1753                                       0x00000BC4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1754                                       0x00000BC8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1755                                       0x00000BCC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1756                                       0x00000BD0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1757                                       0x00000BD4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1758                                       0x00000BD8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1759                                       0x00000BDC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1760                                       0x00000BE0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1761                                       0x00000BE4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1762                                       0x00000BE8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1763                                       0x00000BEC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1764                                       0x00000BF0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1765                                       0x00000BF4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1766                                       0x00000BF8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1767                                       0x00000BFC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1768                                       0x00000C00

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1769                                       0x00000C04

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1770                                       0x00000C08

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1771                                       0x00000C0C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1772                                       0x00000C10

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1773                                       0x00000C14

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1774                                       0x00000C18

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1775                                       0x00000C1C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1776                                       0x00000C20

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1777                                       0x00000C24

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1778                                       0x00000C28

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1779                                       0x00000C2C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1780                                       0x00000C30

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1781                                       0x00000C34

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1782                                       0x00000C38

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1783                                       0x00000C3C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1784                                       0x00000C40

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1785                                       0x00000C44

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1786                                       0x00000C48

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1787                                       0x00000C4C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1788                                       0x00000C50

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1789                                       0x00000C54

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1790                                       0x00000C58

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1791                                       0x00000C5C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1792                                       0x00000C60

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1793                                       0x00000C64

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1794                                       0x00000C68

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1795                                       0x00000C6C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1796                                       0x00000C70

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1797                                       0x00000C74

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1798                                       0x00000C78

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1799                                       0x00000C7C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1800                                       0x00000C80

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1801                                       0x00000C84

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1802                                       0x00000C88

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1803                                       0x00000C8C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1804                                       0x00000C90

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1805                                       0x00000C94

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1806                                       0x00000C98

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1807                                       0x00000C9C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1808                                       0x00000CA0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1809                                       0x00000CA4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1810                                       0x00000CA8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1811                                       0x00000CAC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1812                                       0x00000CB0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1813                                       0x00000CB4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1814                                       0x00000CB8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1815                                       0x00000CBC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1816                                       0x00000CC0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1817                                       0x00000CC4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1818                                       0x00000CC8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1819                                       0x00000CCC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1820                                       0x00000CD0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1821                                       0x00000CD4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1822                                       0x00000CD8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1823                                       0x00000CDC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1824                                       0x00000CE0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1825                                       0x00000CE4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1826                                       0x00000CE8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1827                                       0x00000CEC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1828                                       0x00000CF0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1829                                       0x00000CF4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1830                                       0x00000CF8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1831                                       0x00000CFC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1832                                       0x00000D00

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1833                                       0x00000D04

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1834                                       0x00000D08

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1835                                       0x00000D0C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1836                                       0x00000D10

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1837                                       0x00000D14

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1838                                       0x00000D18

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1839                                       0x00000D1C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1840                                       0x00000D20

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1841                                       0x00000D24

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1842                                       0x00000D28

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1843                                       0x00000D2C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1844                                       0x00000D30

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1845                                       0x00000D34

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1846                                       0x00000D38

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1847                                       0x00000D3C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1848                                       0x00000D40

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1849                                       0x00000D44

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1850                                       0x00000D48

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1851                                       0x00000D4C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1852                                       0x00000D50

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1853                                       0x00000D54

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1854                                       0x00000D58

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1855                                       0x00000D5C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1856                                       0x00000D60

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1857                                       0x00000D64

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1858                                       0x00000D68

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1859                                       0x00000D6C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1860                                       0x00000D70

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1861                                       0x00000D74

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1862                                       0x00000D78

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1863                                       0x00000D7C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1864                                       0x00000D80

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1865                                       0x00000D84

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1866                                       0x00000D88

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1867                                       0x00000D8C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1868                                       0x00000D90

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1869                                       0x00000D94

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1870                                       0x00000D98

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1871                                       0x00000D9C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1872                                       0x00000DA0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1873                                       0x00000DA4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1874                                       0x00000DA8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1875                                       0x00000DAC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1876                                       0x00000DB0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1877                                       0x00000DB4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1878                                       0x00000DB8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1879                                       0x00000DBC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1880                                       0x00000DC0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1881                                       0x00000DC4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1882                                       0x00000DC8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1883                                       0x00000DCC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1884                                       0x00000DD0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1885                                       0x00000DD4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1886                                       0x00000DD8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1887                                       0x00000DDC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1888                                       0x00000DE0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1889                                       0x00000DE4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1890                                       0x00000DE8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1891                                       0x00000DEC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1892                                       0x00000DF0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1893                                       0x00000DF4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1894                                       0x00000DF8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1895                                       0x00000DFC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1896                                       0x00000E00

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1897                                       0x00000E04

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1898                                       0x00000E08

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1899                                       0x00000E0C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1900                                       0x00000E10

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1901                                       0x00000E14

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1902                                       0x00000E18

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1903                                       0x00000E1C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1904                                       0x00000E20

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1905                                       0x00000E24

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1906                                       0x00000E28

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1907                                       0x00000E2C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1908                                       0x00000E30

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1909                                       0x00000E34

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1910                                       0x00000E38

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1911                                       0x00000E3C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1912                                       0x00000E40

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1913                                       0x00000E44

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1914                                       0x00000E48

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1915                                       0x00000E4C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1916                                       0x00000E50

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1917                                       0x00000E54

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1918                                       0x00000E58

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1919                                       0x00000E5C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1920                                       0x00000E60

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1921                                       0x00000E64

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1922                                       0x00000E68

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1923                                       0x00000E6C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1924                                       0x00000E70

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1925                                       0x00000E74

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1926                                       0x00000E78

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1927                                       0x00000E7C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1928                                       0x00000E80

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1929                                       0x00000E84

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1930                                       0x00000E88

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1931                                       0x00000E8C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1932                                       0x00000E90

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1933                                       0x00000E94

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1934                                       0x00000E98

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1935                                       0x00000E9C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1936                                       0x00000EA0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1937                                       0x00000EA4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1938                                       0x00000EA8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1939                                       0x00000EAC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1940                                       0x00000EB0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1941                                       0x00000EB4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1942                                       0x00000EB8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1943                                       0x00000EBC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1944                                       0x00000EC0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1945                                       0x00000EC4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1946                                       0x00000EC8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1947                                       0x00000ECC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1948                                       0x00000ED0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1949                                       0x00000ED4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1950                                       0x00000ED8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1951                                       0x00000EDC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1952                                       0x00000EE0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1953                                       0x00000EE4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1954                                       0x00000EE8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1955                                       0x00000EEC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1956                                       0x00000EF0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1957                                       0x00000EF4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1958                                       0x00000EF8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1959                                       0x00000EFC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1960                                       0x00000F00

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1961                                       0x00000F04

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1962                                       0x00000F08

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1963                                       0x00000F0C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1964                                       0x00000F10

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1965                                       0x00000F14

