zephyrproject-rtos/zephyr/ext/hal/ti/simplelink/source/ti/devices/cc13x2_cc26x2/inc/hw_rfc_ullram.h
// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1966                                       0x00000F18

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1967                                       0x00000F1C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1968                                       0x00000F20

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1969                                       0x00000F24

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1970                                       0x00000F28

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1971                                       0x00000F2C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1972                                       0x00000F30

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1973                                       0x00000F34

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1974                                       0x00000F38

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1975                                       0x00000F3C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1976                                       0x00000F40

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1977                                       0x00000F44

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1978                                       0x00000F48

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1979                                       0x00000F4C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1980                                       0x00000F50

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1981                                       0x00000F54

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1982                                       0x00000F58

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1983                                       0x00000F5C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1984                                       0x00000F60

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1985                                       0x00000F64

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1986                                       0x00000F68

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1987                                       0x00000F6C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1988                                       0x00000F70

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1989                                       0x00000F74

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1990                                       0x00000F78

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1991                                       0x00000F7C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1992                                       0x00000F80

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1993                                       0x00000F84

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1994                                       0x00000F88

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1995                                       0x00000F8C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1996                                       0x00000F90

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1997                                       0x00000F94

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1998                                       0x00000F98

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK1999                                       0x00000F9C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11000                                      0x00000FA0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11001                                      0x00000FA4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11002                                      0x00000FA8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11003                                      0x00000FAC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11004                                      0x00000FB0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11005                                      0x00000FB4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11006                                      0x00000FB8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11007                                      0x00000FBC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11008                                      0x00000FC0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11009                                      0x00000FC4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11010                                      0x00000FC8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11011                                      0x00000FCC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11012                                      0x00000FD0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11013                                      0x00000FD4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11014                                      0x00000FD8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11015                                      0x00000FDC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11016                                      0x00000FE0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11017                                      0x00000FE4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11018                                      0x00000FE8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11019                                      0x00000FEC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11020                                      0x00000FF0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11021                                      0x00000FF4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11022                                      0x00000FF8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11023                                      0x00000FFC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11024                                      0x00001000

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11025                                      0x00001004

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11026                                      0x00001008

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11027                                      0x0000100C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11028                                      0x00001010

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11029                                      0x00001014

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11030                                      0x00001018

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11031                                      0x0000101C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11032                                      0x00001020

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11033                                      0x00001024

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11034                                      0x00001028

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11035                                      0x0000102C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11036                                      0x00001030

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11037                                      0x00001034

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11038                                      0x00001038

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11039                                      0x0000103C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11040                                      0x00001040

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11041                                      0x00001044

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11042                                      0x00001048

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11043                                      0x0000104C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11044                                      0x00001050

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11045                                      0x00001054

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11046                                      0x00001058

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11047                                      0x0000105C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11048                                      0x00001060

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11049                                      0x00001064

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11050                                      0x00001068

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11051                                      0x0000106C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11052                                      0x00001070

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11053                                      0x00001074

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11054                                      0x00001078

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11055                                      0x0000107C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11056                                      0x00001080

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11057                                      0x00001084

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11058                                      0x00001088

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11059                                      0x0000108C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11060                                      0x00001090

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11061                                      0x00001094

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11062                                      0x00001098

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11063                                      0x0000109C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11064                                      0x000010A0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11065                                      0x000010A4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11066                                      0x000010A8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11067                                      0x000010AC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11068                                      0x000010B0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11069                                      0x000010B4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11070                                      0x000010B8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11071                                      0x000010BC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11072                                      0x000010C0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11073                                      0x000010C4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11074                                      0x000010C8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11075                                      0x000010CC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11076                                      0x000010D0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11077                                      0x000010D4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11078                                      0x000010D8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11079                                      0x000010DC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11080                                      0x000010E0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11081                                      0x000010E4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11082                                      0x000010E8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11083                                      0x000010EC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11084                                      0x000010F0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11085                                      0x000010F4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11086                                      0x000010F8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11087                                      0x000010FC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11088                                      0x00001100

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11089                                      0x00001104

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11090                                      0x00001108

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11091                                      0x0000110C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11092                                      0x00001110

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11093                                      0x00001114

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11094                                      0x00001118

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11095                                      0x0000111C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11096                                      0x00001120

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11097                                      0x00001124

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11098                                      0x00001128

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11099                                      0x0000112C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11100                                      0x00001130

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11101                                      0x00001134

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11102                                      0x00001138

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11103                                      0x0000113C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11104                                      0x00001140

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11105                                      0x00001144

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11106                                      0x00001148

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11107                                      0x0000114C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11108                                      0x00001150

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11109                                      0x00001154

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11110                                      0x00001158

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11111                                      0x0000115C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11112                                      0x00001160

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11113                                      0x00001164

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11114                                      0x00001168

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11115                                      0x0000116C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11116                                      0x00001170

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11117                                      0x00001174

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11118                                      0x00001178

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11119                                      0x0000117C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11120                                      0x00001180

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11121                                      0x00001184

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11122                                      0x00001188

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11123                                      0x0000118C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11124                                      0x00001190

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11125                                      0x00001194

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11126                                      0x00001198

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11127                                      0x0000119C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11128                                      0x000011A0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11129                                      0x000011A4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11130                                      0x000011A8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11131                                      0x000011AC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11132                                      0x000011B0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11133                                      0x000011B4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11134                                      0x000011B8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11135                                      0x000011BC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11136                                      0x000011C0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11137                                      0x000011C4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11138                                      0x000011C8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11139                                      0x000011CC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11140                                      0x000011D0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11141                                      0x000011D4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11142                                      0x000011D8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11143                                      0x000011DC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11144                                      0x000011E0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11145                                      0x000011E4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11146                                      0x000011E8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11147                                      0x000011EC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11148                                      0x000011F0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11149                                      0x000011F4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11150                                      0x000011F8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11151                                      0x000011FC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11152                                      0x00001200

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11153                                      0x00001204

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11154                                      0x00001208

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11155                                      0x0000120C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11156                                      0x00001210

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11157                                      0x00001214

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11158                                      0x00001218

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11159                                      0x0000121C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11160                                      0x00001220

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11161                                      0x00001224

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11162                                      0x00001228

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11163                                      0x0000122C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11164                                      0x00001230

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11165                                      0x00001234

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11166                                      0x00001238

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11167                                      0x0000123C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11168                                      0x00001240

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11169                                      0x00001244

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11170                                      0x00001248

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11171                                      0x0000124C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11172                                      0x00001250

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11173                                      0x00001254

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11174                                      0x00001258

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11175                                      0x0000125C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11176                                      0x00001260

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11177                                      0x00001264

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11178                                      0x00001268

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11179                                      0x0000126C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11180                                      0x00001270

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11181                                      0x00001274

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11182                                      0x00001278

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11183                                      0x0000127C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11184                                      0x00001280

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11185                                      0x00001284

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11186                                      0x00001288

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11187                                      0x0000128C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11188                                      0x00001290

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11189                                      0x00001294

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11190                                      0x00001298

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11191                                      0x0000129C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11192                                      0x000012A0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11193                                      0x000012A4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11194                                      0x000012A8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11195                                      0x000012AC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11196                                      0x000012B0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11197                                      0x000012B4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11198                                      0x000012B8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11199                                      0x000012BC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11200                                      0x000012C0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11201                                      0x000012C4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11202                                      0x000012C8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11203                                      0x000012CC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11204                                      0x000012D0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11205                                      0x000012D4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11206                                      0x000012D8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11207                                      0x000012DC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11208                                      0x000012E0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11209                                      0x000012E4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11210                                      0x000012E8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11211                                      0x000012EC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11212                                      0x000012F0

