zephyrproject-rtos/zephyr/ext/hal/ti/simplelink/source/ti/devices/cc13x2_cc26x2/inc/hw_rfc_ullram.h
// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11954                                      0x00001E88

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11955                                      0x00001E8C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11956                                      0x00001E90

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11957                                      0x00001E94

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11958                                      0x00001E98

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11959                                      0x00001E9C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11960                                      0x00001EA0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11961                                      0x00001EA4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11962                                      0x00001EA8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11963                                      0x00001EAC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11964                                      0x00001EB0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11965                                      0x00001EB4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11966                                      0x00001EB8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11967                                      0x00001EBC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11968                                      0x00001EC0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11969                                      0x00001EC4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11970                                      0x00001EC8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11971                                      0x00001ECC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11972                                      0x00001ED0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11973                                      0x00001ED4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11974                                      0x00001ED8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11975                                      0x00001EDC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11976                                      0x00001EE0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11977                                      0x00001EE4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11978                                      0x00001EE8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11979                                      0x00001EEC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11980                                      0x00001EF0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11981                                      0x00001EF4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11982                                      0x00001EF8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11983                                      0x00001EFC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11984                                      0x00001F00

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11985                                      0x00001F04

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11986                                      0x00001F08

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11987                                      0x00001F0C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11988                                      0x00001F10

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11989                                      0x00001F14

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11990                                      0x00001F18

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11991                                      0x00001F1C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11992                                      0x00001F20

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11993                                      0x00001F24

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11994                                      0x00001F28

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11995                                      0x00001F2C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11996                                      0x00001F30

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11997                                      0x00001F34

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11998                                      0x00001F38

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK11999                                      0x00001F3C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK12000                                      0x00001F40

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK12001                                      0x00001F44

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK12002                                      0x00001F48

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK12003                                      0x00001F4C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK12004                                      0x00001F50

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK12005                                      0x00001F54

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK12006                                      0x00001F58

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK12007                                      0x00001F5C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK12008                                      0x00001F60

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK12009                                      0x00001F64

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK12010                                      0x00001F68

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK12011                                      0x00001F6C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK12012                                      0x00001F70

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK12013                                      0x00001F74

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK12014                                      0x00001F78

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK12015                                      0x00001F7C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK12016                                      0x00001F80

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK12017                                      0x00001F84

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK12018                                      0x00001F88

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK12019                                      0x00001F8C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK12020                                      0x00001F90

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK12021                                      0x00001F94

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK12022                                      0x00001F98

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK12023                                      0x00001F9C

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK12024                                      0x00001FA0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK12025                                      0x00001FA4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK12026                                      0x00001FA8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK12027                                      0x00001FAC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK12028                                      0x00001FB0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK12029                                      0x00001FB4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK12030                                      0x00001FB8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK12031                                      0x00001FBC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK12032                                      0x00001FC0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK12033                                      0x00001FC4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK12034                                      0x00001FC8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK12035                                      0x00001FCC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK12036                                      0x00001FD0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK12037                                      0x00001FD4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK12038                                      0x00001FD8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK12039                                      0x00001FDC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK12040                                      0x00001FE0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK12041                                      0x00001FE4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK12042                                      0x00001FE8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK12043                                      0x00001FEC

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK12044                                      0x00001FF0

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK12045                                      0x00001FF4

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK12046                                      0x00001FF8

// 8 kB ULL SRAM
#define RFC_ULLRAM_O_BANK12047                                      0x00001FFC

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK10
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK10_DATA_W                                            32
#define RFC_ULLRAM_BANK10_DATA_M                                    0xFFFFFFFF
#define RFC_ULLRAM_BANK10_DATA_S                                             0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11_DATA_W                                            32
#define RFC_ULLRAM_BANK11_DATA_M                                    0xFFFFFFFF
#define RFC_ULLRAM_BANK11_DATA_S                                             0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK12
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK12_DATA_W                                            32
#define RFC_ULLRAM_BANK12_DATA_M                                    0xFFFFFFFF
#define RFC_ULLRAM_BANK12_DATA_S                                             0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK13
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK13_DATA_W                                            32
#define RFC_ULLRAM_BANK13_DATA_M                                    0xFFFFFFFF
#define RFC_ULLRAM_BANK13_DATA_S                                             0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK14
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK14_DATA_W                                            32
#define RFC_ULLRAM_BANK14_DATA_M                                    0xFFFFFFFF
#define RFC_ULLRAM_BANK14_DATA_S                                             0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK15
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK15_DATA_W                                            32
#define RFC_ULLRAM_BANK15_DATA_M                                    0xFFFFFFFF
#define RFC_ULLRAM_BANK15_DATA_S                                             0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK16
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK16_DATA_W                                            32
#define RFC_ULLRAM_BANK16_DATA_M                                    0xFFFFFFFF
#define RFC_ULLRAM_BANK16_DATA_S                                             0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK17
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK17_DATA_W                                            32
#define RFC_ULLRAM_BANK17_DATA_M                                    0xFFFFFFFF
#define RFC_ULLRAM_BANK17_DATA_S                                             0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK18
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK18_DATA_W                                            32
#define RFC_ULLRAM_BANK18_DATA_M                                    0xFFFFFFFF
#define RFC_ULLRAM_BANK18_DATA_S                                             0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK19
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK19_DATA_W                                            32
#define RFC_ULLRAM_BANK19_DATA_M                                    0xFFFFFFFF
#define RFC_ULLRAM_BANK19_DATA_S                                             0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK110
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK110_DATA_W                                           32
#define RFC_ULLRAM_BANK110_DATA_M                                   0xFFFFFFFF
#define RFC_ULLRAM_BANK110_DATA_S                                            0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK111
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK111_DATA_W                                           32
#define RFC_ULLRAM_BANK111_DATA_M                                   0xFFFFFFFF
#define RFC_ULLRAM_BANK111_DATA_S                                            0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK112
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK112_DATA_W                                           32
#define RFC_ULLRAM_BANK112_DATA_M                                   0xFFFFFFFF
#define RFC_ULLRAM_BANK112_DATA_S                                            0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK113
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK113_DATA_W                                           32
#define RFC_ULLRAM_BANK113_DATA_M                                   0xFFFFFFFF
#define RFC_ULLRAM_BANK113_DATA_S                                            0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK114
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK114_DATA_W                                           32
#define RFC_ULLRAM_BANK114_DATA_M                                   0xFFFFFFFF
#define RFC_ULLRAM_BANK114_DATA_S                                            0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK115
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK115_DATA_W                                           32
#define RFC_ULLRAM_BANK115_DATA_M                                   0xFFFFFFFF
#define RFC_ULLRAM_BANK115_DATA_S                                            0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK116
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK116_DATA_W                                           32
#define RFC_ULLRAM_BANK116_DATA_M                                   0xFFFFFFFF
#define RFC_ULLRAM_BANK116_DATA_S                                            0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK117
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK117_DATA_W                                           32
#define RFC_ULLRAM_BANK117_DATA_M                                   0xFFFFFFFF
#define RFC_ULLRAM_BANK117_DATA_S                                            0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK118
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK118_DATA_W                                           32
#define RFC_ULLRAM_BANK118_DATA_M                                   0xFFFFFFFF
#define RFC_ULLRAM_BANK118_DATA_S                                            0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK119
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK119_DATA_W                                           32
#define RFC_ULLRAM_BANK119_DATA_M                                   0xFFFFFFFF
#define RFC_ULLRAM_BANK119_DATA_S                                            0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK120
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK120_DATA_W                                           32
#define RFC_ULLRAM_BANK120_DATA_M                                   0xFFFFFFFF
#define RFC_ULLRAM_BANK120_DATA_S                                            0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK121
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK121_DATA_W                                           32
#define RFC_ULLRAM_BANK121_DATA_M                                   0xFFFFFFFF
#define RFC_ULLRAM_BANK121_DATA_S                                            0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK122
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK122_DATA_W                                           32
#define RFC_ULLRAM_BANK122_DATA_M                                   0xFFFFFFFF
#define RFC_ULLRAM_BANK122_DATA_S                                            0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK123
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK123_DATA_W                                           32
#define RFC_ULLRAM_BANK123_DATA_M                                   0xFFFFFFFF
#define RFC_ULLRAM_BANK123_DATA_S                                            0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK124
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK124_DATA_W                                           32
#define RFC_ULLRAM_BANK124_DATA_M                                   0xFFFFFFFF
#define RFC_ULLRAM_BANK124_DATA_S                                            0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK125
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK125_DATA_W                                           32
#define RFC_ULLRAM_BANK125_DATA_M                                   0xFFFFFFFF
#define RFC_ULLRAM_BANK125_DATA_S                                            0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK126
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK126_DATA_W                                           32
#define RFC_ULLRAM_BANK126_DATA_M                                   0xFFFFFFFF
#define RFC_ULLRAM_BANK126_DATA_S                                            0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK127
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK127_DATA_W                                           32
#define RFC_ULLRAM_BANK127_DATA_M                                   0xFFFFFFFF
#define RFC_ULLRAM_BANK127_DATA_S                                            0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK128
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK128_DATA_W                                           32
#define RFC_ULLRAM_BANK128_DATA_M                                   0xFFFFFFFF
#define RFC_ULLRAM_BANK128_DATA_S                                            0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK129
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK129_DATA_W                                           32
#define RFC_ULLRAM_BANK129_DATA_M                                   0xFFFFFFFF
#define RFC_ULLRAM_BANK129_DATA_S                                            0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK130
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK130_DATA_W                                           32
#define RFC_ULLRAM_BANK130_DATA_M                                   0xFFFFFFFF
#define RFC_ULLRAM_BANK130_DATA_S                                            0

