zephyrproject-rtos/zephyr/ext/hal/ti/simplelink/source/ti/devices/cc13x2_cc26x2/inc/hw_rfc_ullram.h
//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1131
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1131_DATA_W                                          32
#define RFC_ULLRAM_BANK1131_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1131_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1132
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1132_DATA_W                                          32
#define RFC_ULLRAM_BANK1132_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1132_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1133
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1133_DATA_W                                          32
#define RFC_ULLRAM_BANK1133_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1133_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1134
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1134_DATA_W                                          32
#define RFC_ULLRAM_BANK1134_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1134_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1135
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1135_DATA_W                                          32
#define RFC_ULLRAM_BANK1135_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1135_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1136
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1136_DATA_W                                          32
#define RFC_ULLRAM_BANK1136_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1136_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1137
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1137_DATA_W                                          32
#define RFC_ULLRAM_BANK1137_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1137_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1138
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1138_DATA_W                                          32
#define RFC_ULLRAM_BANK1138_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1138_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1139
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1139_DATA_W                                          32
#define RFC_ULLRAM_BANK1139_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1139_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1140
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1140_DATA_W                                          32
#define RFC_ULLRAM_BANK1140_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1140_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1141
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1141_DATA_W                                          32
#define RFC_ULLRAM_BANK1141_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1141_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1142
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1142_DATA_W                                          32
#define RFC_ULLRAM_BANK1142_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1142_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1143
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1143_DATA_W                                          32
#define RFC_ULLRAM_BANK1143_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1143_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1144
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1144_DATA_W                                          32
#define RFC_ULLRAM_BANK1144_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1144_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1145
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1145_DATA_W                                          32
#define RFC_ULLRAM_BANK1145_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1145_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1146
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1146_DATA_W                                          32
#define RFC_ULLRAM_BANK1146_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1146_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1147
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1147_DATA_W                                          32
#define RFC_ULLRAM_BANK1147_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1147_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1148
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1148_DATA_W                                          32
#define RFC_ULLRAM_BANK1148_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1148_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1149
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1149_DATA_W                                          32
#define RFC_ULLRAM_BANK1149_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1149_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1150
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1150_DATA_W                                          32
#define RFC_ULLRAM_BANK1150_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1150_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1151
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1151_DATA_W                                          32
#define RFC_ULLRAM_BANK1151_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1151_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1152
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1152_DATA_W                                          32
#define RFC_ULLRAM_BANK1152_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1152_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1153
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1153_DATA_W                                          32
#define RFC_ULLRAM_BANK1153_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1153_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1154
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1154_DATA_W                                          32
#define RFC_ULLRAM_BANK1154_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1154_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1155
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1155_DATA_W                                          32
#define RFC_ULLRAM_BANK1155_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1155_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1156
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1156_DATA_W                                          32
#define RFC_ULLRAM_BANK1156_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1156_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1157
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1157_DATA_W                                          32
#define RFC_ULLRAM_BANK1157_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1157_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1158
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1158_DATA_W                                          32
#define RFC_ULLRAM_BANK1158_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1158_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1159
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1159_DATA_W                                          32
#define RFC_ULLRAM_BANK1159_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1159_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1160
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1160_DATA_W                                          32
#define RFC_ULLRAM_BANK1160_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1160_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1161
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1161_DATA_W                                          32
#define RFC_ULLRAM_BANK1161_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1161_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1162
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1162_DATA_W                                          32
#define RFC_ULLRAM_BANK1162_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1162_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1163
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1163_DATA_W                                          32
#define RFC_ULLRAM_BANK1163_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1163_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1164
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1164_DATA_W                                          32
#define RFC_ULLRAM_BANK1164_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1164_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1165
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1165_DATA_W                                          32
#define RFC_ULLRAM_BANK1165_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1165_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1166
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1166_DATA_W                                          32
#define RFC_ULLRAM_BANK1166_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1166_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1167
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1167_DATA_W                                          32
#define RFC_ULLRAM_BANK1167_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1167_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1168
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1168_DATA_W                                          32
#define RFC_ULLRAM_BANK1168_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1168_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1169
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1169_DATA_W                                          32
#define RFC_ULLRAM_BANK1169_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1169_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1170
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1170_DATA_W                                          32
#define RFC_ULLRAM_BANK1170_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1170_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1171
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1171_DATA_W                                          32
#define RFC_ULLRAM_BANK1171_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1171_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1172
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1172_DATA_W                                          32
#define RFC_ULLRAM_BANK1172_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1172_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1173
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1173_DATA_W                                          32
#define RFC_ULLRAM_BANK1173_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1173_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1174
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1174_DATA_W                                          32
#define RFC_ULLRAM_BANK1174_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1174_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1175
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1175_DATA_W                                          32
#define RFC_ULLRAM_BANK1175_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1175_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1176
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1176_DATA_W                                          32
#define RFC_ULLRAM_BANK1176_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1176_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1177
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1177_DATA_W                                          32
#define RFC_ULLRAM_BANK1177_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1177_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1178
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1178_DATA_W                                          32
#define RFC_ULLRAM_BANK1178_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1178_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1179
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1179_DATA_W                                          32
#define RFC_ULLRAM_BANK1179_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1179_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1180
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1180_DATA_W                                          32
#define RFC_ULLRAM_BANK1180_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1180_DATA_S                                           0

