zephyrproject-rtos/zephyr/ext/hal/ti/simplelink/source/ti/devices/cc13x2_cc26x2/inc/hw_rfc_ullram.h
//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1331
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1331_DATA_W                                          32
#define RFC_ULLRAM_BANK1331_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1331_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1332
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1332_DATA_W                                          32
#define RFC_ULLRAM_BANK1332_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1332_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1333
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1333_DATA_W                                          32
#define RFC_ULLRAM_BANK1333_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1333_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1334
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1334_DATA_W                                          32
#define RFC_ULLRAM_BANK1334_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1334_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1335
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1335_DATA_W                                          32
#define RFC_ULLRAM_BANK1335_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1335_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1336
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1336_DATA_W                                          32
#define RFC_ULLRAM_BANK1336_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1336_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1337
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1337_DATA_W                                          32
#define RFC_ULLRAM_BANK1337_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1337_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1338
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1338_DATA_W                                          32
#define RFC_ULLRAM_BANK1338_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1338_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1339
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1339_DATA_W                                          32
#define RFC_ULLRAM_BANK1339_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1339_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1340
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1340_DATA_W                                          32
#define RFC_ULLRAM_BANK1340_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1340_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1341
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1341_DATA_W                                          32
#define RFC_ULLRAM_BANK1341_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1341_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1342
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1342_DATA_W                                          32
#define RFC_ULLRAM_BANK1342_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1342_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1343
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1343_DATA_W                                          32
#define RFC_ULLRAM_BANK1343_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1343_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1344
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1344_DATA_W                                          32
#define RFC_ULLRAM_BANK1344_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1344_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1345
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1345_DATA_W                                          32
#define RFC_ULLRAM_BANK1345_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1345_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1346
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1346_DATA_W                                          32
#define RFC_ULLRAM_BANK1346_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1346_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1347
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1347_DATA_W                                          32
#define RFC_ULLRAM_BANK1347_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1347_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1348
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1348_DATA_W                                          32
#define RFC_ULLRAM_BANK1348_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1348_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1349
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1349_DATA_W                                          32
#define RFC_ULLRAM_BANK1349_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1349_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1350
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1350_DATA_W                                          32
#define RFC_ULLRAM_BANK1350_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1350_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1351
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1351_DATA_W                                          32
#define RFC_ULLRAM_BANK1351_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1351_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1352
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1352_DATA_W                                          32
#define RFC_ULLRAM_BANK1352_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1352_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1353
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1353_DATA_W                                          32
#define RFC_ULLRAM_BANK1353_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1353_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1354
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1354_DATA_W                                          32
#define RFC_ULLRAM_BANK1354_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1354_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1355
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1355_DATA_W                                          32
#define RFC_ULLRAM_BANK1355_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1355_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1356
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1356_DATA_W                                          32
#define RFC_ULLRAM_BANK1356_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1356_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1357
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1357_DATA_W                                          32
#define RFC_ULLRAM_BANK1357_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1357_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1358
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1358_DATA_W                                          32
#define RFC_ULLRAM_BANK1358_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1358_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1359
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1359_DATA_W                                          32
#define RFC_ULLRAM_BANK1359_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1359_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1360
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1360_DATA_W                                          32
#define RFC_ULLRAM_BANK1360_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1360_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1361
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1361_DATA_W                                          32
#define RFC_ULLRAM_BANK1361_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1361_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1362
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1362_DATA_W                                          32
#define RFC_ULLRAM_BANK1362_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1362_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1363
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1363_DATA_W                                          32
#define RFC_ULLRAM_BANK1363_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1363_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1364
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1364_DATA_W                                          32
#define RFC_ULLRAM_BANK1364_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1364_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1365
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1365_DATA_W                                          32
#define RFC_ULLRAM_BANK1365_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1365_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1366
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1366_DATA_W                                          32
#define RFC_ULLRAM_BANK1366_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1366_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1367
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1367_DATA_W                                          32
#define RFC_ULLRAM_BANK1367_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1367_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1368
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1368_DATA_W                                          32
#define RFC_ULLRAM_BANK1368_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1368_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1369
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1369_DATA_W                                          32
#define RFC_ULLRAM_BANK1369_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1369_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1370
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1370_DATA_W                                          32
#define RFC_ULLRAM_BANK1370_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1370_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1371
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1371_DATA_W                                          32
#define RFC_ULLRAM_BANK1371_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1371_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1372
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1372_DATA_W                                          32
#define RFC_ULLRAM_BANK1372_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1372_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1373
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1373_DATA_W                                          32
#define RFC_ULLRAM_BANK1373_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1373_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1374
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1374_DATA_W                                          32
#define RFC_ULLRAM_BANK1374_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1374_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1375
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1375_DATA_W                                          32
#define RFC_ULLRAM_BANK1375_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1375_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1376
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1376_DATA_W                                          32
#define RFC_ULLRAM_BANK1376_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1376_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1377
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1377_DATA_W                                          32
#define RFC_ULLRAM_BANK1377_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1377_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1378
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1378_DATA_W                                          32
#define RFC_ULLRAM_BANK1378_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1378_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1379
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1379_DATA_W                                          32
#define RFC_ULLRAM_BANK1379_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1379_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1380
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1380_DATA_W                                          32
#define RFC_ULLRAM_BANK1380_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1380_DATA_S                                           0

