zephyrproject-rtos/zephyr/ext/hal/ti/simplelink/source/ti/devices/cc13x2_cc26x2/inc/hw_rfc_ullram.h
//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1381
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1381_DATA_W                                          32
#define RFC_ULLRAM_BANK1381_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1381_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1382
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1382_DATA_W                                          32
#define RFC_ULLRAM_BANK1382_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1382_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1383
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1383_DATA_W                                          32
#define RFC_ULLRAM_BANK1383_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1383_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1384
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1384_DATA_W                                          32
#define RFC_ULLRAM_BANK1384_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1384_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1385
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1385_DATA_W                                          32
#define RFC_ULLRAM_BANK1385_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1385_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1386
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1386_DATA_W                                          32
#define RFC_ULLRAM_BANK1386_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1386_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1387
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1387_DATA_W                                          32
#define RFC_ULLRAM_BANK1387_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1387_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1388
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1388_DATA_W                                          32
#define RFC_ULLRAM_BANK1388_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1388_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1389
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1389_DATA_W                                          32
#define RFC_ULLRAM_BANK1389_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1389_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1390
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1390_DATA_W                                          32
#define RFC_ULLRAM_BANK1390_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1390_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1391
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1391_DATA_W                                          32
#define RFC_ULLRAM_BANK1391_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1391_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1392
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1392_DATA_W                                          32
#define RFC_ULLRAM_BANK1392_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1392_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1393
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1393_DATA_W                                          32
#define RFC_ULLRAM_BANK1393_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1393_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1394
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1394_DATA_W                                          32
#define RFC_ULLRAM_BANK1394_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1394_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1395
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1395_DATA_W                                          32
#define RFC_ULLRAM_BANK1395_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1395_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1396
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1396_DATA_W                                          32
#define RFC_ULLRAM_BANK1396_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1396_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1397
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1397_DATA_W                                          32
#define RFC_ULLRAM_BANK1397_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1397_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1398
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1398_DATA_W                                          32
#define RFC_ULLRAM_BANK1398_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1398_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1399
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1399_DATA_W                                          32
#define RFC_ULLRAM_BANK1399_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1399_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1400
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1400_DATA_W                                          32
#define RFC_ULLRAM_BANK1400_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1400_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1401
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1401_DATA_W                                          32
#define RFC_ULLRAM_BANK1401_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1401_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1402
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1402_DATA_W                                          32
#define RFC_ULLRAM_BANK1402_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1402_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1403
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1403_DATA_W                                          32
#define RFC_ULLRAM_BANK1403_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1403_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1404
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1404_DATA_W                                          32
#define RFC_ULLRAM_BANK1404_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1404_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1405
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1405_DATA_W                                          32
#define RFC_ULLRAM_BANK1405_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1405_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1406
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1406_DATA_W                                          32
#define RFC_ULLRAM_BANK1406_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1406_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1407
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1407_DATA_W                                          32
#define RFC_ULLRAM_BANK1407_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1407_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1408
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1408_DATA_W                                          32
#define RFC_ULLRAM_BANK1408_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1408_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1409
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1409_DATA_W                                          32
#define RFC_ULLRAM_BANK1409_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1409_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1410
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1410_DATA_W                                          32
#define RFC_ULLRAM_BANK1410_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1410_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1411
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1411_DATA_W                                          32
#define RFC_ULLRAM_BANK1411_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1411_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1412
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1412_DATA_W                                          32
#define RFC_ULLRAM_BANK1412_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1412_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1413
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1413_DATA_W                                          32
#define RFC_ULLRAM_BANK1413_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1413_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1414
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1414_DATA_W                                          32
#define RFC_ULLRAM_BANK1414_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1414_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1415
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1415_DATA_W                                          32
#define RFC_ULLRAM_BANK1415_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1415_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1416
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1416_DATA_W                                          32
#define RFC_ULLRAM_BANK1416_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1416_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1417
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1417_DATA_W                                          32
#define RFC_ULLRAM_BANK1417_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1417_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1418
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1418_DATA_W                                          32
#define RFC_ULLRAM_BANK1418_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1418_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1419
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1419_DATA_W                                          32
#define RFC_ULLRAM_BANK1419_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1419_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1420
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1420_DATA_W                                          32
#define RFC_ULLRAM_BANK1420_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1420_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1421
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1421_DATA_W                                          32
#define RFC_ULLRAM_BANK1421_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1421_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1422
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1422_DATA_W                                          32
#define RFC_ULLRAM_BANK1422_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1422_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1423
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1423_DATA_W                                          32
#define RFC_ULLRAM_BANK1423_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1423_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1424
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1424_DATA_W                                          32
#define RFC_ULLRAM_BANK1424_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1424_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1425
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1425_DATA_W                                          32
#define RFC_ULLRAM_BANK1425_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1425_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1426
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1426_DATA_W                                          32
#define RFC_ULLRAM_BANK1426_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1426_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1427
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1427_DATA_W                                          32
#define RFC_ULLRAM_BANK1427_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1427_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1428
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1428_DATA_W                                          32
#define RFC_ULLRAM_BANK1428_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1428_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1429
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1429_DATA_W                                          32
#define RFC_ULLRAM_BANK1429_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1429_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1430
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1430_DATA_W                                          32
#define RFC_ULLRAM_BANK1430_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1430_DATA_S                                           0

