zephyrproject-rtos/zephyr/ext/hal/ti/simplelink/source/ti/devices/cc13x2_cc26x2/inc/hw_rfc_ullram.h
//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1481
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1481_DATA_W                                          32
#define RFC_ULLRAM_BANK1481_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1481_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1482
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1482_DATA_W                                          32
#define RFC_ULLRAM_BANK1482_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1482_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1483
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1483_DATA_W                                          32
#define RFC_ULLRAM_BANK1483_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1483_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1484
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1484_DATA_W                                          32
#define RFC_ULLRAM_BANK1484_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1484_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1485
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1485_DATA_W                                          32
#define RFC_ULLRAM_BANK1485_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1485_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1486
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1486_DATA_W                                          32
#define RFC_ULLRAM_BANK1486_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1486_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1487
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1487_DATA_W                                          32
#define RFC_ULLRAM_BANK1487_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1487_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1488
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1488_DATA_W                                          32
#define RFC_ULLRAM_BANK1488_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1488_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1489
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1489_DATA_W                                          32
#define RFC_ULLRAM_BANK1489_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1489_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1490
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1490_DATA_W                                          32
#define RFC_ULLRAM_BANK1490_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1490_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1491
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1491_DATA_W                                          32
#define RFC_ULLRAM_BANK1491_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1491_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1492
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1492_DATA_W                                          32
#define RFC_ULLRAM_BANK1492_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1492_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1493
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1493_DATA_W                                          32
#define RFC_ULLRAM_BANK1493_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1493_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1494
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1494_DATA_W                                          32
#define RFC_ULLRAM_BANK1494_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1494_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1495
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1495_DATA_W                                          32
#define RFC_ULLRAM_BANK1495_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1495_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1496
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1496_DATA_W                                          32
#define RFC_ULLRAM_BANK1496_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1496_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1497
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1497_DATA_W                                          32
#define RFC_ULLRAM_BANK1497_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1497_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1498
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1498_DATA_W                                          32
#define RFC_ULLRAM_BANK1498_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1498_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1499
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1499_DATA_W                                          32
#define RFC_ULLRAM_BANK1499_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1499_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1500
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1500_DATA_W                                          32
#define RFC_ULLRAM_BANK1500_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1500_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1501
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1501_DATA_W                                          32
#define RFC_ULLRAM_BANK1501_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1501_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1502
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1502_DATA_W                                          32
#define RFC_ULLRAM_BANK1502_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1502_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1503
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1503_DATA_W                                          32
#define RFC_ULLRAM_BANK1503_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1503_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1504
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1504_DATA_W                                          32
#define RFC_ULLRAM_BANK1504_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1504_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1505
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1505_DATA_W                                          32
#define RFC_ULLRAM_BANK1505_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1505_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1506
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1506_DATA_W                                          32
#define RFC_ULLRAM_BANK1506_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1506_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1507
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1507_DATA_W                                          32
#define RFC_ULLRAM_BANK1507_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1507_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1508
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1508_DATA_W                                          32
#define RFC_ULLRAM_BANK1508_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1508_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1509
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1509_DATA_W                                          32
#define RFC_ULLRAM_BANK1509_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1509_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1510
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1510_DATA_W                                          32
#define RFC_ULLRAM_BANK1510_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1510_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1511
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1511_DATA_W                                          32
#define RFC_ULLRAM_BANK1511_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1511_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1512
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1512_DATA_W                                          32
#define RFC_ULLRAM_BANK1512_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1512_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1513
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1513_DATA_W                                          32
#define RFC_ULLRAM_BANK1513_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1513_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1514
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1514_DATA_W                                          32
#define RFC_ULLRAM_BANK1514_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1514_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1515
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1515_DATA_W                                          32
#define RFC_ULLRAM_BANK1515_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1515_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1516
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1516_DATA_W                                          32
#define RFC_ULLRAM_BANK1516_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1516_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1517
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1517_DATA_W                                          32
#define RFC_ULLRAM_BANK1517_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1517_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1518
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1518_DATA_W                                          32
#define RFC_ULLRAM_BANK1518_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1518_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1519
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1519_DATA_W                                          32
#define RFC_ULLRAM_BANK1519_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1519_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1520
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1520_DATA_W                                          32
#define RFC_ULLRAM_BANK1520_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1520_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1521
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1521_DATA_W                                          32
#define RFC_ULLRAM_BANK1521_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1521_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1522
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1522_DATA_W                                          32
#define RFC_ULLRAM_BANK1522_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1522_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1523
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1523_DATA_W                                          32
#define RFC_ULLRAM_BANK1523_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1523_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1524
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1524_DATA_W                                          32
#define RFC_ULLRAM_BANK1524_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1524_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1525
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1525_DATA_W                                          32
#define RFC_ULLRAM_BANK1525_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1525_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1526
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1526_DATA_W                                          32
#define RFC_ULLRAM_BANK1526_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1526_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1527
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1527_DATA_W                                          32
#define RFC_ULLRAM_BANK1527_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1527_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1528
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1528_DATA_W                                          32
#define RFC_ULLRAM_BANK1528_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1528_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1529
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1529_DATA_W                                          32
#define RFC_ULLRAM_BANK1529_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1529_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1530
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1530_DATA_W                                          32
#define RFC_ULLRAM_BANK1530_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1530_DATA_S                                           0

