zephyrproject-rtos/zephyr/ext/hal/ti/simplelink/source/ti/devices/cc13x2_cc26x2/inc/hw_rfc_ullram.h
//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1581
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1581_DATA_W                                          32
#define RFC_ULLRAM_BANK1581_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1581_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1582
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1582_DATA_W                                          32
#define RFC_ULLRAM_BANK1582_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1582_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1583
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1583_DATA_W                                          32
#define RFC_ULLRAM_BANK1583_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1583_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1584
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1584_DATA_W                                          32
#define RFC_ULLRAM_BANK1584_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1584_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1585
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1585_DATA_W                                          32
#define RFC_ULLRAM_BANK1585_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1585_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1586
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1586_DATA_W                                          32
#define RFC_ULLRAM_BANK1586_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1586_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1587
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1587_DATA_W                                          32
#define RFC_ULLRAM_BANK1587_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1587_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1588
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1588_DATA_W                                          32
#define RFC_ULLRAM_BANK1588_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1588_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1589
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1589_DATA_W                                          32
#define RFC_ULLRAM_BANK1589_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1589_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1590
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1590_DATA_W                                          32
#define RFC_ULLRAM_BANK1590_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1590_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1591
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1591_DATA_W                                          32
#define RFC_ULLRAM_BANK1591_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1591_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1592
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1592_DATA_W                                          32
#define RFC_ULLRAM_BANK1592_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1592_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1593
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1593_DATA_W                                          32
#define RFC_ULLRAM_BANK1593_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1593_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1594
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1594_DATA_W                                          32
#define RFC_ULLRAM_BANK1594_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1594_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1595
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1595_DATA_W                                          32
#define RFC_ULLRAM_BANK1595_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1595_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1596
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1596_DATA_W                                          32
#define RFC_ULLRAM_BANK1596_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1596_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1597
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1597_DATA_W                                          32
#define RFC_ULLRAM_BANK1597_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1597_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1598
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1598_DATA_W                                          32
#define RFC_ULLRAM_BANK1598_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1598_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1599
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1599_DATA_W                                          32
#define RFC_ULLRAM_BANK1599_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1599_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1600
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1600_DATA_W                                          32
#define RFC_ULLRAM_BANK1600_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1600_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1601
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1601_DATA_W                                          32
#define RFC_ULLRAM_BANK1601_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1601_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1602
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1602_DATA_W                                          32
#define RFC_ULLRAM_BANK1602_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1602_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1603
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1603_DATA_W                                          32
#define RFC_ULLRAM_BANK1603_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1603_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1604
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1604_DATA_W                                          32
#define RFC_ULLRAM_BANK1604_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1604_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1605
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1605_DATA_W                                          32
#define RFC_ULLRAM_BANK1605_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1605_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1606
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1606_DATA_W                                          32
#define RFC_ULLRAM_BANK1606_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1606_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1607
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1607_DATA_W                                          32
#define RFC_ULLRAM_BANK1607_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1607_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1608
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1608_DATA_W                                          32
#define RFC_ULLRAM_BANK1608_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1608_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1609
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1609_DATA_W                                          32
#define RFC_ULLRAM_BANK1609_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1609_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1610
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1610_DATA_W                                          32
#define RFC_ULLRAM_BANK1610_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1610_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1611
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1611_DATA_W                                          32
#define RFC_ULLRAM_BANK1611_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1611_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1612
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1612_DATA_W                                          32
#define RFC_ULLRAM_BANK1612_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1612_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1613
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1613_DATA_W                                          32
#define RFC_ULLRAM_BANK1613_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1613_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1614
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1614_DATA_W                                          32
#define RFC_ULLRAM_BANK1614_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1614_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1615
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1615_DATA_W                                          32
#define RFC_ULLRAM_BANK1615_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1615_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1616
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1616_DATA_W                                          32
#define RFC_ULLRAM_BANK1616_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1616_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1617
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1617_DATA_W                                          32
#define RFC_ULLRAM_BANK1617_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1617_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1618
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1618_DATA_W                                          32
#define RFC_ULLRAM_BANK1618_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1618_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1619
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1619_DATA_W                                          32
#define RFC_ULLRAM_BANK1619_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1619_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1620
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1620_DATA_W                                          32
#define RFC_ULLRAM_BANK1620_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1620_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1621
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1621_DATA_W                                          32
#define RFC_ULLRAM_BANK1621_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1621_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1622
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1622_DATA_W                                          32
#define RFC_ULLRAM_BANK1622_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1622_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1623
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1623_DATA_W                                          32
#define RFC_ULLRAM_BANK1623_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1623_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1624
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1624_DATA_W                                          32
#define RFC_ULLRAM_BANK1624_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1624_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1625
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1625_DATA_W                                          32
#define RFC_ULLRAM_BANK1625_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1625_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1626
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1626_DATA_W                                          32
#define RFC_ULLRAM_BANK1626_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1626_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1627
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1627_DATA_W                                          32
#define RFC_ULLRAM_BANK1627_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1627_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1628
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1628_DATA_W                                          32
#define RFC_ULLRAM_BANK1628_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1628_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1629
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1629_DATA_W                                          32
#define RFC_ULLRAM_BANK1629_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1629_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1630
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1630_DATA_W                                          32
#define RFC_ULLRAM_BANK1630_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1630_DATA_S                                           0

