zephyrproject-rtos/zephyr/ext/hal/ti/simplelink/source/ti/devices/cc13x2_cc26x2/inc/hw_rfc_ullram.h
//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1631
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1631_DATA_W                                          32
#define RFC_ULLRAM_BANK1631_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1631_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1632
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1632_DATA_W                                          32
#define RFC_ULLRAM_BANK1632_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1632_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1633
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1633_DATA_W                                          32
#define RFC_ULLRAM_BANK1633_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1633_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1634
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1634_DATA_W                                          32
#define RFC_ULLRAM_BANK1634_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1634_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1635
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1635_DATA_W                                          32
#define RFC_ULLRAM_BANK1635_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1635_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1636
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1636_DATA_W                                          32
#define RFC_ULLRAM_BANK1636_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1636_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1637
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1637_DATA_W                                          32
#define RFC_ULLRAM_BANK1637_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1637_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1638
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1638_DATA_W                                          32
#define RFC_ULLRAM_BANK1638_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1638_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1639
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1639_DATA_W                                          32
#define RFC_ULLRAM_BANK1639_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1639_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1640
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1640_DATA_W                                          32
#define RFC_ULLRAM_BANK1640_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1640_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1641
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1641_DATA_W                                          32
#define RFC_ULLRAM_BANK1641_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1641_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1642
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1642_DATA_W                                          32
#define RFC_ULLRAM_BANK1642_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1642_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1643
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1643_DATA_W                                          32
#define RFC_ULLRAM_BANK1643_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1643_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1644
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1644_DATA_W                                          32
#define RFC_ULLRAM_BANK1644_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1644_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1645
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1645_DATA_W                                          32
#define RFC_ULLRAM_BANK1645_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1645_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1646
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1646_DATA_W                                          32
#define RFC_ULLRAM_BANK1646_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1646_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1647
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1647_DATA_W                                          32
#define RFC_ULLRAM_BANK1647_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1647_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1648
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1648_DATA_W                                          32
#define RFC_ULLRAM_BANK1648_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1648_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1649
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1649_DATA_W                                          32
#define RFC_ULLRAM_BANK1649_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1649_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1650
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1650_DATA_W                                          32
#define RFC_ULLRAM_BANK1650_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1650_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1651
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1651_DATA_W                                          32
#define RFC_ULLRAM_BANK1651_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1651_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1652
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1652_DATA_W                                          32
#define RFC_ULLRAM_BANK1652_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1652_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1653
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1653_DATA_W                                          32
#define RFC_ULLRAM_BANK1653_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1653_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1654
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1654_DATA_W                                          32
#define RFC_ULLRAM_BANK1654_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1654_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1655
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1655_DATA_W                                          32
#define RFC_ULLRAM_BANK1655_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1655_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1656
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1656_DATA_W                                          32
#define RFC_ULLRAM_BANK1656_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1656_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1657
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1657_DATA_W                                          32
#define RFC_ULLRAM_BANK1657_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1657_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1658
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1658_DATA_W                                          32
#define RFC_ULLRAM_BANK1658_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1658_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1659
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1659_DATA_W                                          32
#define RFC_ULLRAM_BANK1659_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1659_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1660
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1660_DATA_W                                          32
#define RFC_ULLRAM_BANK1660_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1660_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1661
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1661_DATA_W                                          32
#define RFC_ULLRAM_BANK1661_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1661_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1662
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1662_DATA_W                                          32
#define RFC_ULLRAM_BANK1662_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1662_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1663
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1663_DATA_W                                          32
#define RFC_ULLRAM_BANK1663_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1663_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1664
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1664_DATA_W                                          32
#define RFC_ULLRAM_BANK1664_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1664_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1665
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1665_DATA_W                                          32
#define RFC_ULLRAM_BANK1665_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1665_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1666
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1666_DATA_W                                          32
#define RFC_ULLRAM_BANK1666_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1666_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1667
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1667_DATA_W                                          32
#define RFC_ULLRAM_BANK1667_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1667_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1668
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1668_DATA_W                                          32
#define RFC_ULLRAM_BANK1668_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1668_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1669
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1669_DATA_W                                          32
#define RFC_ULLRAM_BANK1669_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1669_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1670
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1670_DATA_W                                          32
#define RFC_ULLRAM_BANK1670_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1670_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1671
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1671_DATA_W                                          32
#define RFC_ULLRAM_BANK1671_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1671_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1672
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1672_DATA_W                                          32
#define RFC_ULLRAM_BANK1672_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1672_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1673
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1673_DATA_W                                          32
#define RFC_ULLRAM_BANK1673_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1673_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1674
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1674_DATA_W                                          32
#define RFC_ULLRAM_BANK1674_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1674_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1675
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1675_DATA_W                                          32
#define RFC_ULLRAM_BANK1675_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1675_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1676
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1676_DATA_W                                          32
#define RFC_ULLRAM_BANK1676_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1676_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1677
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1677_DATA_W                                          32
#define RFC_ULLRAM_BANK1677_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1677_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1678
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1678_DATA_W                                          32
#define RFC_ULLRAM_BANK1678_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1678_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1679
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1679_DATA_W                                          32
#define RFC_ULLRAM_BANK1679_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1679_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1680
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1680_DATA_W                                          32
#define RFC_ULLRAM_BANK1680_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1680_DATA_S                                           0

