zephyrproject-rtos/zephyr/ext/hal/ti/simplelink/source/ti/devices/cc13x2_cc26x2/inc/hw_rfc_ullram.h
//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1681
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1681_DATA_W                                          32
#define RFC_ULLRAM_BANK1681_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1681_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1682
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1682_DATA_W                                          32
#define RFC_ULLRAM_BANK1682_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1682_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1683
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1683_DATA_W                                          32
#define RFC_ULLRAM_BANK1683_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1683_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1684
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1684_DATA_W                                          32
#define RFC_ULLRAM_BANK1684_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1684_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1685
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1685_DATA_W                                          32
#define RFC_ULLRAM_BANK1685_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1685_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1686
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1686_DATA_W                                          32
#define RFC_ULLRAM_BANK1686_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1686_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1687
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1687_DATA_W                                          32
#define RFC_ULLRAM_BANK1687_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1687_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1688
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1688_DATA_W                                          32
#define RFC_ULLRAM_BANK1688_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1688_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1689
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1689_DATA_W                                          32
#define RFC_ULLRAM_BANK1689_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1689_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1690
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1690_DATA_W                                          32
#define RFC_ULLRAM_BANK1690_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1690_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1691
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1691_DATA_W                                          32
#define RFC_ULLRAM_BANK1691_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1691_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1692
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1692_DATA_W                                          32
#define RFC_ULLRAM_BANK1692_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1692_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1693
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1693_DATA_W                                          32
#define RFC_ULLRAM_BANK1693_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1693_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1694
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1694_DATA_W                                          32
#define RFC_ULLRAM_BANK1694_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1694_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1695
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1695_DATA_W                                          32
#define RFC_ULLRAM_BANK1695_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1695_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1696
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1696_DATA_W                                          32
#define RFC_ULLRAM_BANK1696_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1696_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1697
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1697_DATA_W                                          32
#define RFC_ULLRAM_BANK1697_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1697_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1698
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1698_DATA_W                                          32
#define RFC_ULLRAM_BANK1698_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1698_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1699
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1699_DATA_W                                          32
#define RFC_ULLRAM_BANK1699_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1699_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1700
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1700_DATA_W                                          32
#define RFC_ULLRAM_BANK1700_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1700_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1701
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1701_DATA_W                                          32
#define RFC_ULLRAM_BANK1701_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1701_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1702
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1702_DATA_W                                          32
#define RFC_ULLRAM_BANK1702_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1702_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1703
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1703_DATA_W                                          32
#define RFC_ULLRAM_BANK1703_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1703_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1704
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1704_DATA_W                                          32
#define RFC_ULLRAM_BANK1704_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1704_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1705
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1705_DATA_W                                          32
#define RFC_ULLRAM_BANK1705_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1705_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1706
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1706_DATA_W                                          32
#define RFC_ULLRAM_BANK1706_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1706_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1707
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1707_DATA_W                                          32
#define RFC_ULLRAM_BANK1707_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1707_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1708
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1708_DATA_W                                          32
#define RFC_ULLRAM_BANK1708_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1708_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1709
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1709_DATA_W                                          32
#define RFC_ULLRAM_BANK1709_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1709_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1710
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1710_DATA_W                                          32
#define RFC_ULLRAM_BANK1710_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1710_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1711
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1711_DATA_W                                          32
#define RFC_ULLRAM_BANK1711_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1711_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1712
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1712_DATA_W                                          32
#define RFC_ULLRAM_BANK1712_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1712_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1713
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1713_DATA_W                                          32
#define RFC_ULLRAM_BANK1713_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1713_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1714
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1714_DATA_W                                          32
#define RFC_ULLRAM_BANK1714_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1714_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1715
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1715_DATA_W                                          32
#define RFC_ULLRAM_BANK1715_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1715_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1716
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1716_DATA_W                                          32
#define RFC_ULLRAM_BANK1716_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1716_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1717
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1717_DATA_W                                          32
#define RFC_ULLRAM_BANK1717_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1717_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1718
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1718_DATA_W                                          32
#define RFC_ULLRAM_BANK1718_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1718_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1719
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1719_DATA_W                                          32
#define RFC_ULLRAM_BANK1719_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1719_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1720
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1720_DATA_W                                          32
#define RFC_ULLRAM_BANK1720_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1720_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1721
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1721_DATA_W                                          32
#define RFC_ULLRAM_BANK1721_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1721_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1722
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1722_DATA_W                                          32
#define RFC_ULLRAM_BANK1722_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1722_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1723
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1723_DATA_W                                          32
#define RFC_ULLRAM_BANK1723_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1723_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1724
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1724_DATA_W                                          32
#define RFC_ULLRAM_BANK1724_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1724_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1725
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1725_DATA_W                                          32
#define RFC_ULLRAM_BANK1725_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1725_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1726
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1726_DATA_W                                          32
#define RFC_ULLRAM_BANK1726_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1726_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1727
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1727_DATA_W                                          32
#define RFC_ULLRAM_BANK1727_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1727_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1728
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1728_DATA_W                                          32
#define RFC_ULLRAM_BANK1728_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1728_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1729
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1729_DATA_W                                          32
#define RFC_ULLRAM_BANK1729_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1729_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1730
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1730_DATA_W                                          32
#define RFC_ULLRAM_BANK1730_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1730_DATA_S                                           0

