zephyrproject-rtos/zephyr/ext/hal/ti/simplelink/source/ti/devices/cc13x2_cc26x2/inc/hw_rfc_ullram.h
//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1881
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1881_DATA_W                                          32
#define RFC_ULLRAM_BANK1881_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1881_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1882
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1882_DATA_W                                          32
#define RFC_ULLRAM_BANK1882_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1882_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1883
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1883_DATA_W                                          32
#define RFC_ULLRAM_BANK1883_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1883_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1884
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1884_DATA_W                                          32
#define RFC_ULLRAM_BANK1884_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1884_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1885
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1885_DATA_W                                          32
#define RFC_ULLRAM_BANK1885_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1885_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1886
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1886_DATA_W                                          32
#define RFC_ULLRAM_BANK1886_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1886_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1887
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1887_DATA_W                                          32
#define RFC_ULLRAM_BANK1887_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1887_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1888
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1888_DATA_W                                          32
#define RFC_ULLRAM_BANK1888_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1888_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1889
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1889_DATA_W                                          32
#define RFC_ULLRAM_BANK1889_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1889_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1890
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1890_DATA_W                                          32
#define RFC_ULLRAM_BANK1890_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1890_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1891
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1891_DATA_W                                          32
#define RFC_ULLRAM_BANK1891_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1891_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1892
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1892_DATA_W                                          32
#define RFC_ULLRAM_BANK1892_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1892_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1893
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1893_DATA_W                                          32
#define RFC_ULLRAM_BANK1893_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1893_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1894
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1894_DATA_W                                          32
#define RFC_ULLRAM_BANK1894_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1894_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1895
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1895_DATA_W                                          32
#define RFC_ULLRAM_BANK1895_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1895_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1896
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1896_DATA_W                                          32
#define RFC_ULLRAM_BANK1896_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1896_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1897
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1897_DATA_W                                          32
#define RFC_ULLRAM_BANK1897_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1897_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1898
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1898_DATA_W                                          32
#define RFC_ULLRAM_BANK1898_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1898_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1899
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1899_DATA_W                                          32
#define RFC_ULLRAM_BANK1899_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1899_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1900
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1900_DATA_W                                          32
#define RFC_ULLRAM_BANK1900_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1900_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1901
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1901_DATA_W                                          32
#define RFC_ULLRAM_BANK1901_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1901_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1902
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1902_DATA_W                                          32
#define RFC_ULLRAM_BANK1902_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1902_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1903
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1903_DATA_W                                          32
#define RFC_ULLRAM_BANK1903_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1903_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1904
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1904_DATA_W                                          32
#define RFC_ULLRAM_BANK1904_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1904_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1905
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1905_DATA_W                                          32
#define RFC_ULLRAM_BANK1905_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1905_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1906
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1906_DATA_W                                          32
#define RFC_ULLRAM_BANK1906_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1906_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1907
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1907_DATA_W                                          32
#define RFC_ULLRAM_BANK1907_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1907_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1908
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1908_DATA_W                                          32
#define RFC_ULLRAM_BANK1908_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1908_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1909
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1909_DATA_W                                          32
#define RFC_ULLRAM_BANK1909_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1909_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1910
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1910_DATA_W                                          32
#define RFC_ULLRAM_BANK1910_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1910_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1911
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1911_DATA_W                                          32
#define RFC_ULLRAM_BANK1911_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1911_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1912
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1912_DATA_W                                          32
#define RFC_ULLRAM_BANK1912_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1912_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1913
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1913_DATA_W                                          32
#define RFC_ULLRAM_BANK1913_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1913_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1914
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1914_DATA_W                                          32
#define RFC_ULLRAM_BANK1914_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1914_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1915
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1915_DATA_W                                          32
#define RFC_ULLRAM_BANK1915_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1915_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1916
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1916_DATA_W                                          32
#define RFC_ULLRAM_BANK1916_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1916_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1917
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1917_DATA_W                                          32
#define RFC_ULLRAM_BANK1917_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1917_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1918
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1918_DATA_W                                          32
#define RFC_ULLRAM_BANK1918_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1918_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1919
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1919_DATA_W                                          32
#define RFC_ULLRAM_BANK1919_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1919_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1920
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1920_DATA_W                                          32
#define RFC_ULLRAM_BANK1920_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1920_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1921
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1921_DATA_W                                          32
#define RFC_ULLRAM_BANK1921_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1921_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1922
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1922_DATA_W                                          32
#define RFC_ULLRAM_BANK1922_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1922_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1923
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1923_DATA_W                                          32
#define RFC_ULLRAM_BANK1923_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1923_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1924
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1924_DATA_W                                          32
#define RFC_ULLRAM_BANK1924_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1924_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1925
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1925_DATA_W                                          32
#define RFC_ULLRAM_BANK1925_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1925_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1926
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1926_DATA_W                                          32
#define RFC_ULLRAM_BANK1926_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1926_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1927
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1927_DATA_W                                          32
#define RFC_ULLRAM_BANK1927_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1927_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1928
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1928_DATA_W                                          32
#define RFC_ULLRAM_BANK1928_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1928_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1929
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1929_DATA_W                                          32
#define RFC_ULLRAM_BANK1929_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1929_DATA_S                                           0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK1930
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK1930_DATA_W                                          32
#define RFC_ULLRAM_BANK1930_DATA_M                                  0xFFFFFFFF
#define RFC_ULLRAM_BANK1930_DATA_S                                           0

