zephyrproject-rtos/zephyr/ext/hal/ti/simplelink/source/ti/devices/cc13x2_cc26x2/inc/hw_rfc_ullram.h
//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11231
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11231_DATA_W                                         32
#define RFC_ULLRAM_BANK11231_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11231_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11232
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11232_DATA_W                                         32
#define RFC_ULLRAM_BANK11232_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11232_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11233
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11233_DATA_W                                         32
#define RFC_ULLRAM_BANK11233_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11233_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11234
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11234_DATA_W                                         32
#define RFC_ULLRAM_BANK11234_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11234_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11235
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11235_DATA_W                                         32
#define RFC_ULLRAM_BANK11235_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11235_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11236
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11236_DATA_W                                         32
#define RFC_ULLRAM_BANK11236_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11236_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11237
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11237_DATA_W                                         32
#define RFC_ULLRAM_BANK11237_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11237_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11238
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11238_DATA_W                                         32
#define RFC_ULLRAM_BANK11238_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11238_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11239
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11239_DATA_W                                         32
#define RFC_ULLRAM_BANK11239_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11239_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11240
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11240_DATA_W                                         32
#define RFC_ULLRAM_BANK11240_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11240_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11241
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11241_DATA_W                                         32
#define RFC_ULLRAM_BANK11241_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11241_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11242
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11242_DATA_W                                         32
#define RFC_ULLRAM_BANK11242_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11242_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11243
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11243_DATA_W                                         32
#define RFC_ULLRAM_BANK11243_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11243_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11244
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11244_DATA_W                                         32
#define RFC_ULLRAM_BANK11244_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11244_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11245
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11245_DATA_W                                         32
#define RFC_ULLRAM_BANK11245_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11245_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11246
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11246_DATA_W                                         32
#define RFC_ULLRAM_BANK11246_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11246_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11247
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11247_DATA_W                                         32
#define RFC_ULLRAM_BANK11247_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11247_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11248
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11248_DATA_W                                         32
#define RFC_ULLRAM_BANK11248_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11248_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11249
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11249_DATA_W                                         32
#define RFC_ULLRAM_BANK11249_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11249_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11250
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11250_DATA_W                                         32
#define RFC_ULLRAM_BANK11250_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11250_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11251
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11251_DATA_W                                         32
#define RFC_ULLRAM_BANK11251_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11251_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11252
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11252_DATA_W                                         32
#define RFC_ULLRAM_BANK11252_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11252_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11253
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11253_DATA_W                                         32
#define RFC_ULLRAM_BANK11253_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11253_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11254
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11254_DATA_W                                         32
#define RFC_ULLRAM_BANK11254_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11254_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11255
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11255_DATA_W                                         32
#define RFC_ULLRAM_BANK11255_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11255_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11256
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11256_DATA_W                                         32
#define RFC_ULLRAM_BANK11256_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11256_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11257
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11257_DATA_W                                         32
#define RFC_ULLRAM_BANK11257_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11257_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11258
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11258_DATA_W                                         32
#define RFC_ULLRAM_BANK11258_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11258_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11259
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11259_DATA_W                                         32
#define RFC_ULLRAM_BANK11259_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11259_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11260
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11260_DATA_W                                         32
#define RFC_ULLRAM_BANK11260_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11260_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11261
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11261_DATA_W                                         32
#define RFC_ULLRAM_BANK11261_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11261_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11262
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11262_DATA_W                                         32
#define RFC_ULLRAM_BANK11262_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11262_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11263
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11263_DATA_W                                         32
#define RFC_ULLRAM_BANK11263_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11263_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11264
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11264_DATA_W                                         32
#define RFC_ULLRAM_BANK11264_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11264_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11265
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11265_DATA_W                                         32
#define RFC_ULLRAM_BANK11265_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11265_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11266
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11266_DATA_W                                         32
#define RFC_ULLRAM_BANK11266_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11266_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11267
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11267_DATA_W                                         32
#define RFC_ULLRAM_BANK11267_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11267_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11268
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11268_DATA_W                                         32
#define RFC_ULLRAM_BANK11268_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11268_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11269
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11269_DATA_W                                         32
#define RFC_ULLRAM_BANK11269_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11269_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11270
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11270_DATA_W                                         32
#define RFC_ULLRAM_BANK11270_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11270_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11271
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11271_DATA_W                                         32
#define RFC_ULLRAM_BANK11271_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11271_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11272
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11272_DATA_W                                         32
#define RFC_ULLRAM_BANK11272_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11272_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11273
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11273_DATA_W                                         32
#define RFC_ULLRAM_BANK11273_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11273_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11274
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11274_DATA_W                                         32
#define RFC_ULLRAM_BANK11274_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11274_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11275
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11275_DATA_W                                         32
#define RFC_ULLRAM_BANK11275_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11275_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11276
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11276_DATA_W                                         32
#define RFC_ULLRAM_BANK11276_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11276_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11277
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11277_DATA_W                                         32
#define RFC_ULLRAM_BANK11277_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11277_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11278
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11278_DATA_W                                         32
#define RFC_ULLRAM_BANK11278_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11278_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11279
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11279_DATA_W                                         32
#define RFC_ULLRAM_BANK11279_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11279_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11280
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11280_DATA_W                                         32
#define RFC_ULLRAM_BANK11280_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11280_DATA_S                                          0

