zephyrproject-rtos/zephyr/ext/hal/ti/simplelink/source/ti/devices/cc13x2_cc26x2/inc/hw_rfc_ullram.h
//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11331
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11331_DATA_W                                         32
#define RFC_ULLRAM_BANK11331_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11331_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11332
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11332_DATA_W                                         32
#define RFC_ULLRAM_BANK11332_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11332_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11333
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11333_DATA_W                                         32
#define RFC_ULLRAM_BANK11333_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11333_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11334
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11334_DATA_W                                         32
#define RFC_ULLRAM_BANK11334_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11334_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11335
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11335_DATA_W                                         32
#define RFC_ULLRAM_BANK11335_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11335_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11336
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11336_DATA_W                                         32
#define RFC_ULLRAM_BANK11336_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11336_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11337
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11337_DATA_W                                         32
#define RFC_ULLRAM_BANK11337_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11337_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11338
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11338_DATA_W                                         32
#define RFC_ULLRAM_BANK11338_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11338_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11339
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11339_DATA_W                                         32
#define RFC_ULLRAM_BANK11339_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11339_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11340
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11340_DATA_W                                         32
#define RFC_ULLRAM_BANK11340_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11340_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11341
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11341_DATA_W                                         32
#define RFC_ULLRAM_BANK11341_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11341_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11342
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11342_DATA_W                                         32
#define RFC_ULLRAM_BANK11342_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11342_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11343
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11343_DATA_W                                         32
#define RFC_ULLRAM_BANK11343_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11343_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11344
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11344_DATA_W                                         32
#define RFC_ULLRAM_BANK11344_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11344_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11345
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11345_DATA_W                                         32
#define RFC_ULLRAM_BANK11345_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11345_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11346
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11346_DATA_W                                         32
#define RFC_ULLRAM_BANK11346_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11346_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11347
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11347_DATA_W                                         32
#define RFC_ULLRAM_BANK11347_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11347_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11348
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11348_DATA_W                                         32
#define RFC_ULLRAM_BANK11348_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11348_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11349
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11349_DATA_W                                         32
#define RFC_ULLRAM_BANK11349_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11349_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11350
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11350_DATA_W                                         32
#define RFC_ULLRAM_BANK11350_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11350_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11351
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11351_DATA_W                                         32
#define RFC_ULLRAM_BANK11351_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11351_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11352
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11352_DATA_W                                         32
#define RFC_ULLRAM_BANK11352_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11352_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11353
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11353_DATA_W                                         32
#define RFC_ULLRAM_BANK11353_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11353_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11354
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11354_DATA_W                                         32
#define RFC_ULLRAM_BANK11354_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11354_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11355
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11355_DATA_W                                         32
#define RFC_ULLRAM_BANK11355_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11355_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11356
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11356_DATA_W                                         32
#define RFC_ULLRAM_BANK11356_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11356_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11357
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11357_DATA_W                                         32
#define RFC_ULLRAM_BANK11357_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11357_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11358
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11358_DATA_W                                         32
#define RFC_ULLRAM_BANK11358_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11358_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11359
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11359_DATA_W                                         32
#define RFC_ULLRAM_BANK11359_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11359_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11360
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11360_DATA_W                                         32
#define RFC_ULLRAM_BANK11360_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11360_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11361
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11361_DATA_W                                         32
#define RFC_ULLRAM_BANK11361_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11361_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11362
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11362_DATA_W                                         32
#define RFC_ULLRAM_BANK11362_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11362_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11363
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11363_DATA_W                                         32
#define RFC_ULLRAM_BANK11363_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11363_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11364
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11364_DATA_W                                         32
#define RFC_ULLRAM_BANK11364_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11364_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11365
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11365_DATA_W                                         32
#define RFC_ULLRAM_BANK11365_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11365_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11366
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11366_DATA_W                                         32
#define RFC_ULLRAM_BANK11366_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11366_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11367
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11367_DATA_W                                         32
#define RFC_ULLRAM_BANK11367_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11367_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11368
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11368_DATA_W                                         32
#define RFC_ULLRAM_BANK11368_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11368_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11369
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11369_DATA_W                                         32
#define RFC_ULLRAM_BANK11369_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11369_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11370
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11370_DATA_W                                         32
#define RFC_ULLRAM_BANK11370_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11370_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11371
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11371_DATA_W                                         32
#define RFC_ULLRAM_BANK11371_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11371_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11372
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11372_DATA_W                                         32
#define RFC_ULLRAM_BANK11372_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11372_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11373
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11373_DATA_W                                         32
#define RFC_ULLRAM_BANK11373_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11373_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11374
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11374_DATA_W                                         32
#define RFC_ULLRAM_BANK11374_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11374_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11375
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11375_DATA_W                                         32
#define RFC_ULLRAM_BANK11375_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11375_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11376
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11376_DATA_W                                         32
#define RFC_ULLRAM_BANK11376_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11376_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11377
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11377_DATA_W                                         32
#define RFC_ULLRAM_BANK11377_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11377_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11378
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11378_DATA_W                                         32
#define RFC_ULLRAM_BANK11378_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11378_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11379
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11379_DATA_W                                         32
#define RFC_ULLRAM_BANK11379_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11379_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11380
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11380_DATA_W                                         32
#define RFC_ULLRAM_BANK11380_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11380_DATA_S                                          0

