zephyrproject-rtos/zephyr/ext/hal/ti/simplelink/source/ti/devices/cc13x2_cc26x2/inc/hw_rfc_ullram.h
//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11431
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11431_DATA_W                                         32
#define RFC_ULLRAM_BANK11431_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11431_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11432
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11432_DATA_W                                         32
#define RFC_ULLRAM_BANK11432_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11432_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11433
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11433_DATA_W                                         32
#define RFC_ULLRAM_BANK11433_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11433_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11434
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11434_DATA_W                                         32
#define RFC_ULLRAM_BANK11434_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11434_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11435
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11435_DATA_W                                         32
#define RFC_ULLRAM_BANK11435_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11435_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11436
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11436_DATA_W                                         32
#define RFC_ULLRAM_BANK11436_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11436_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11437
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11437_DATA_W                                         32
#define RFC_ULLRAM_BANK11437_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11437_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11438
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11438_DATA_W                                         32
#define RFC_ULLRAM_BANK11438_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11438_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11439
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11439_DATA_W                                         32
#define RFC_ULLRAM_BANK11439_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11439_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11440
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11440_DATA_W                                         32
#define RFC_ULLRAM_BANK11440_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11440_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11441
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11441_DATA_W                                         32
#define RFC_ULLRAM_BANK11441_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11441_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11442
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11442_DATA_W                                         32
#define RFC_ULLRAM_BANK11442_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11442_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11443
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11443_DATA_W                                         32
#define RFC_ULLRAM_BANK11443_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11443_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11444
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11444_DATA_W                                         32
#define RFC_ULLRAM_BANK11444_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11444_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11445
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11445_DATA_W                                         32
#define RFC_ULLRAM_BANK11445_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11445_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11446
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11446_DATA_W                                         32
#define RFC_ULLRAM_BANK11446_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11446_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11447
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11447_DATA_W                                         32
#define RFC_ULLRAM_BANK11447_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11447_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11448
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11448_DATA_W                                         32
#define RFC_ULLRAM_BANK11448_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11448_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11449
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11449_DATA_W                                         32
#define RFC_ULLRAM_BANK11449_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11449_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11450
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11450_DATA_W                                         32
#define RFC_ULLRAM_BANK11450_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11450_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11451
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11451_DATA_W                                         32
#define RFC_ULLRAM_BANK11451_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11451_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11452
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11452_DATA_W                                         32
#define RFC_ULLRAM_BANK11452_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11452_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11453
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11453_DATA_W                                         32
#define RFC_ULLRAM_BANK11453_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11453_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11454
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11454_DATA_W                                         32
#define RFC_ULLRAM_BANK11454_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11454_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11455
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11455_DATA_W                                         32
#define RFC_ULLRAM_BANK11455_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11455_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11456
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11456_DATA_W                                         32
#define RFC_ULLRAM_BANK11456_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11456_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11457
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11457_DATA_W                                         32
#define RFC_ULLRAM_BANK11457_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11457_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11458
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11458_DATA_W                                         32
#define RFC_ULLRAM_BANK11458_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11458_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11459
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11459_DATA_W                                         32
#define RFC_ULLRAM_BANK11459_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11459_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11460
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11460_DATA_W                                         32
#define RFC_ULLRAM_BANK11460_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11460_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11461
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11461_DATA_W                                         32
#define RFC_ULLRAM_BANK11461_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11461_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11462
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11462_DATA_W                                         32
#define RFC_ULLRAM_BANK11462_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11462_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11463
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11463_DATA_W                                         32
#define RFC_ULLRAM_BANK11463_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11463_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11464
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11464_DATA_W                                         32
#define RFC_ULLRAM_BANK11464_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11464_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11465
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11465_DATA_W                                         32
#define RFC_ULLRAM_BANK11465_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11465_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11466
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11466_DATA_W                                         32
#define RFC_ULLRAM_BANK11466_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11466_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11467
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11467_DATA_W                                         32
#define RFC_ULLRAM_BANK11467_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11467_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11468
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11468_DATA_W                                         32
#define RFC_ULLRAM_BANK11468_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11468_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11469
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11469_DATA_W                                         32
#define RFC_ULLRAM_BANK11469_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11469_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11470
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11470_DATA_W                                         32
#define RFC_ULLRAM_BANK11470_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11470_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11471
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11471_DATA_W                                         32
#define RFC_ULLRAM_BANK11471_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11471_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11472
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11472_DATA_W                                         32
#define RFC_ULLRAM_BANK11472_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11472_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11473
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11473_DATA_W                                         32
#define RFC_ULLRAM_BANK11473_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11473_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11474
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11474_DATA_W                                         32
#define RFC_ULLRAM_BANK11474_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11474_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11475
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11475_DATA_W                                         32
#define RFC_ULLRAM_BANK11475_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11475_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11476
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11476_DATA_W                                         32
#define RFC_ULLRAM_BANK11476_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11476_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11477
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11477_DATA_W                                         32
#define RFC_ULLRAM_BANK11477_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11477_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11478
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11478_DATA_W                                         32
#define RFC_ULLRAM_BANK11478_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11478_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11479
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11479_DATA_W                                         32
#define RFC_ULLRAM_BANK11479_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11479_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11480
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11480_DATA_W                                         32
#define RFC_ULLRAM_BANK11480_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11480_DATA_S                                          0

