zephyrproject-rtos/zephyr/ext/hal/ti/simplelink/source/ti/devices/cc13x2_cc26x2/inc/hw_rfc_ullram.h
//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11631
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11631_DATA_W                                         32
#define RFC_ULLRAM_BANK11631_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11631_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11632
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11632_DATA_W                                         32
#define RFC_ULLRAM_BANK11632_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11632_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11633
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11633_DATA_W                                         32
#define RFC_ULLRAM_BANK11633_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11633_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11634
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11634_DATA_W                                         32
#define RFC_ULLRAM_BANK11634_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11634_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11635
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11635_DATA_W                                         32
#define RFC_ULLRAM_BANK11635_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11635_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11636
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11636_DATA_W                                         32
#define RFC_ULLRAM_BANK11636_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11636_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11637
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11637_DATA_W                                         32
#define RFC_ULLRAM_BANK11637_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11637_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11638
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11638_DATA_W                                         32
#define RFC_ULLRAM_BANK11638_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11638_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11639
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11639_DATA_W                                         32
#define RFC_ULLRAM_BANK11639_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11639_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11640
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11640_DATA_W                                         32
#define RFC_ULLRAM_BANK11640_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11640_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11641
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11641_DATA_W                                         32
#define RFC_ULLRAM_BANK11641_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11641_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11642
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11642_DATA_W                                         32
#define RFC_ULLRAM_BANK11642_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11642_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11643
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11643_DATA_W                                         32
#define RFC_ULLRAM_BANK11643_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11643_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11644
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11644_DATA_W                                         32
#define RFC_ULLRAM_BANK11644_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11644_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11645
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11645_DATA_W                                         32
#define RFC_ULLRAM_BANK11645_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11645_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11646
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11646_DATA_W                                         32
#define RFC_ULLRAM_BANK11646_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11646_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11647
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11647_DATA_W                                         32
#define RFC_ULLRAM_BANK11647_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11647_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11648
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11648_DATA_W                                         32
#define RFC_ULLRAM_BANK11648_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11648_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11649
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11649_DATA_W                                         32
#define RFC_ULLRAM_BANK11649_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11649_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11650
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11650_DATA_W                                         32
#define RFC_ULLRAM_BANK11650_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11650_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11651
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11651_DATA_W                                         32
#define RFC_ULLRAM_BANK11651_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11651_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11652
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11652_DATA_W                                         32
#define RFC_ULLRAM_BANK11652_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11652_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11653
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11653_DATA_W                                         32
#define RFC_ULLRAM_BANK11653_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11653_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11654
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11654_DATA_W                                         32
#define RFC_ULLRAM_BANK11654_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11654_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11655
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11655_DATA_W                                         32
#define RFC_ULLRAM_BANK11655_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11655_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11656
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11656_DATA_W                                         32
#define RFC_ULLRAM_BANK11656_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11656_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11657
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11657_DATA_W                                         32
#define RFC_ULLRAM_BANK11657_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11657_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11658
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11658_DATA_W                                         32
#define RFC_ULLRAM_BANK11658_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11658_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11659
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11659_DATA_W                                         32
#define RFC_ULLRAM_BANK11659_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11659_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11660
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11660_DATA_W                                         32
#define RFC_ULLRAM_BANK11660_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11660_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11661
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11661_DATA_W                                         32
#define RFC_ULLRAM_BANK11661_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11661_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11662
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11662_DATA_W                                         32
#define RFC_ULLRAM_BANK11662_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11662_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11663
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11663_DATA_W                                         32
#define RFC_ULLRAM_BANK11663_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11663_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11664
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11664_DATA_W                                         32
#define RFC_ULLRAM_BANK11664_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11664_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11665
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11665_DATA_W                                         32
#define RFC_ULLRAM_BANK11665_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11665_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11666
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11666_DATA_W                                         32
#define RFC_ULLRAM_BANK11666_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11666_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11667
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11667_DATA_W                                         32
#define RFC_ULLRAM_BANK11667_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11667_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11668
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11668_DATA_W                                         32
#define RFC_ULLRAM_BANK11668_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11668_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11669
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11669_DATA_W                                         32
#define RFC_ULLRAM_BANK11669_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11669_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11670
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11670_DATA_W                                         32
#define RFC_ULLRAM_BANK11670_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11670_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11671
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11671_DATA_W                                         32
#define RFC_ULLRAM_BANK11671_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11671_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11672
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11672_DATA_W                                         32
#define RFC_ULLRAM_BANK11672_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11672_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11673
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11673_DATA_W                                         32
#define RFC_ULLRAM_BANK11673_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11673_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11674
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11674_DATA_W                                         32
#define RFC_ULLRAM_BANK11674_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11674_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11675
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11675_DATA_W                                         32
#define RFC_ULLRAM_BANK11675_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11675_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11676
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11676_DATA_W                                         32
#define RFC_ULLRAM_BANK11676_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11676_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11677
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11677_DATA_W                                         32
#define RFC_ULLRAM_BANK11677_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11677_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11678
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11678_DATA_W                                         32
#define RFC_ULLRAM_BANK11678_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11678_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11679
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11679_DATA_W                                         32
#define RFC_ULLRAM_BANK11679_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11679_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11680
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11680_DATA_W                                         32
#define RFC_ULLRAM_BANK11680_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11680_DATA_S                                          0

