zephyrproject-rtos/zephyr/ext/hal/ti/simplelink/source/ti/devices/cc13x2_cc26x2/inc/hw_rfc_ullram.h
//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11781
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11781_DATA_W                                         32
#define RFC_ULLRAM_BANK11781_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11781_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11782
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11782_DATA_W                                         32
#define RFC_ULLRAM_BANK11782_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11782_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11783
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11783_DATA_W                                         32
#define RFC_ULLRAM_BANK11783_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11783_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11784
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11784_DATA_W                                         32
#define RFC_ULLRAM_BANK11784_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11784_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11785
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11785_DATA_W                                         32
#define RFC_ULLRAM_BANK11785_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11785_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11786
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11786_DATA_W                                         32
#define RFC_ULLRAM_BANK11786_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11786_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11787
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11787_DATA_W                                         32
#define RFC_ULLRAM_BANK11787_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11787_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11788
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11788_DATA_W                                         32
#define RFC_ULLRAM_BANK11788_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11788_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11789
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11789_DATA_W                                         32
#define RFC_ULLRAM_BANK11789_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11789_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11790
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11790_DATA_W                                         32
#define RFC_ULLRAM_BANK11790_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11790_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11791
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11791_DATA_W                                         32
#define RFC_ULLRAM_BANK11791_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11791_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11792
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11792_DATA_W                                         32
#define RFC_ULLRAM_BANK11792_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11792_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11793
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11793_DATA_W                                         32
#define RFC_ULLRAM_BANK11793_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11793_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11794
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11794_DATA_W                                         32
#define RFC_ULLRAM_BANK11794_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11794_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11795
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11795_DATA_W                                         32
#define RFC_ULLRAM_BANK11795_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11795_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11796
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11796_DATA_W                                         32
#define RFC_ULLRAM_BANK11796_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11796_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11797
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11797_DATA_W                                         32
#define RFC_ULLRAM_BANK11797_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11797_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11798
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11798_DATA_W                                         32
#define RFC_ULLRAM_BANK11798_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11798_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11799
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11799_DATA_W                                         32
#define RFC_ULLRAM_BANK11799_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11799_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11800
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11800_DATA_W                                         32
#define RFC_ULLRAM_BANK11800_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11800_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11801
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11801_DATA_W                                         32
#define RFC_ULLRAM_BANK11801_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11801_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11802
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11802_DATA_W                                         32
#define RFC_ULLRAM_BANK11802_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11802_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11803
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11803_DATA_W                                         32
#define RFC_ULLRAM_BANK11803_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11803_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11804
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11804_DATA_W                                         32
#define RFC_ULLRAM_BANK11804_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11804_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11805
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11805_DATA_W                                         32
#define RFC_ULLRAM_BANK11805_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11805_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11806
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11806_DATA_W                                         32
#define RFC_ULLRAM_BANK11806_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11806_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11807
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11807_DATA_W                                         32
#define RFC_ULLRAM_BANK11807_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11807_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11808
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11808_DATA_W                                         32
#define RFC_ULLRAM_BANK11808_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11808_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11809
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11809_DATA_W                                         32
#define RFC_ULLRAM_BANK11809_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11809_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11810
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11810_DATA_W                                         32
#define RFC_ULLRAM_BANK11810_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11810_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11811
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11811_DATA_W                                         32
#define RFC_ULLRAM_BANK11811_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11811_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11812
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11812_DATA_W                                         32
#define RFC_ULLRAM_BANK11812_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11812_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11813
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11813_DATA_W                                         32
#define RFC_ULLRAM_BANK11813_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11813_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11814
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11814_DATA_W                                         32
#define RFC_ULLRAM_BANK11814_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11814_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11815
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11815_DATA_W                                         32
#define RFC_ULLRAM_BANK11815_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11815_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11816
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11816_DATA_W                                         32
#define RFC_ULLRAM_BANK11816_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11816_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11817
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11817_DATA_W                                         32
#define RFC_ULLRAM_BANK11817_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11817_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11818
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11818_DATA_W                                         32
#define RFC_ULLRAM_BANK11818_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11818_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11819
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11819_DATA_W                                         32
#define RFC_ULLRAM_BANK11819_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11819_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11820
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11820_DATA_W                                         32
#define RFC_ULLRAM_BANK11820_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11820_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11821
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11821_DATA_W                                         32
#define RFC_ULLRAM_BANK11821_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11821_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11822
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11822_DATA_W                                         32
#define RFC_ULLRAM_BANK11822_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11822_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11823
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11823_DATA_W                                         32
#define RFC_ULLRAM_BANK11823_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11823_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11824
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11824_DATA_W                                         32
#define RFC_ULLRAM_BANK11824_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11824_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11825
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11825_DATA_W                                         32
#define RFC_ULLRAM_BANK11825_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11825_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11826
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11826_DATA_W                                         32
#define RFC_ULLRAM_BANK11826_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11826_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11827
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11827_DATA_W                                         32
#define RFC_ULLRAM_BANK11827_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11827_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11828
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11828_DATA_W                                         32
#define RFC_ULLRAM_BANK11828_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11828_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11829
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11829_DATA_W                                         32
#define RFC_ULLRAM_BANK11829_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11829_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11830
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11830_DATA_W                                         32
#define RFC_ULLRAM_BANK11830_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11830_DATA_S                                          0

