zephyrproject-rtos/zephyr/ext/hal/ti/simplelink/source/ti/devices/cc13x2_cc26x2/inc/hw_rfc_ullram.h
//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11831
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11831_DATA_W                                         32
#define RFC_ULLRAM_BANK11831_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11831_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11832
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11832_DATA_W                                         32
#define RFC_ULLRAM_BANK11832_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11832_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11833
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11833_DATA_W                                         32
#define RFC_ULLRAM_BANK11833_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11833_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11834
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11834_DATA_W                                         32
#define RFC_ULLRAM_BANK11834_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11834_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11835
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11835_DATA_W                                         32
#define RFC_ULLRAM_BANK11835_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11835_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11836
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11836_DATA_W                                         32
#define RFC_ULLRAM_BANK11836_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11836_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11837
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11837_DATA_W                                         32
#define RFC_ULLRAM_BANK11837_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11837_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11838
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11838_DATA_W                                         32
#define RFC_ULLRAM_BANK11838_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11838_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11839
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11839_DATA_W                                         32
#define RFC_ULLRAM_BANK11839_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11839_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11840
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11840_DATA_W                                         32
#define RFC_ULLRAM_BANK11840_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11840_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11841
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11841_DATA_W                                         32
#define RFC_ULLRAM_BANK11841_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11841_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11842
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11842_DATA_W                                         32
#define RFC_ULLRAM_BANK11842_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11842_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11843
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11843_DATA_W                                         32
#define RFC_ULLRAM_BANK11843_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11843_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11844
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11844_DATA_W                                         32
#define RFC_ULLRAM_BANK11844_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11844_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11845
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11845_DATA_W                                         32
#define RFC_ULLRAM_BANK11845_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11845_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11846
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11846_DATA_W                                         32
#define RFC_ULLRAM_BANK11846_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11846_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11847
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11847_DATA_W                                         32
#define RFC_ULLRAM_BANK11847_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11847_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11848
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11848_DATA_W                                         32
#define RFC_ULLRAM_BANK11848_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11848_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11849
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11849_DATA_W                                         32
#define RFC_ULLRAM_BANK11849_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11849_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11850
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11850_DATA_W                                         32
#define RFC_ULLRAM_BANK11850_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11850_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11851
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11851_DATA_W                                         32
#define RFC_ULLRAM_BANK11851_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11851_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11852
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11852_DATA_W                                         32
#define RFC_ULLRAM_BANK11852_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11852_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11853
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11853_DATA_W                                         32
#define RFC_ULLRAM_BANK11853_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11853_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11854
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11854_DATA_W                                         32
#define RFC_ULLRAM_BANK11854_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11854_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11855
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11855_DATA_W                                         32
#define RFC_ULLRAM_BANK11855_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11855_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11856
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11856_DATA_W                                         32
#define RFC_ULLRAM_BANK11856_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11856_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11857
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11857_DATA_W                                         32
#define RFC_ULLRAM_BANK11857_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11857_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11858
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11858_DATA_W                                         32
#define RFC_ULLRAM_BANK11858_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11858_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11859
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11859_DATA_W                                         32
#define RFC_ULLRAM_BANK11859_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11859_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11860
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11860_DATA_W                                         32
#define RFC_ULLRAM_BANK11860_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11860_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11861
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11861_DATA_W                                         32
#define RFC_ULLRAM_BANK11861_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11861_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11862
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11862_DATA_W                                         32
#define RFC_ULLRAM_BANK11862_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11862_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11863
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11863_DATA_W                                         32
#define RFC_ULLRAM_BANK11863_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11863_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11864
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11864_DATA_W                                         32
#define RFC_ULLRAM_BANK11864_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11864_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11865
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11865_DATA_W                                         32
#define RFC_ULLRAM_BANK11865_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11865_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11866
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11866_DATA_W                                         32
#define RFC_ULLRAM_BANK11866_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11866_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11867
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11867_DATA_W                                         32
#define RFC_ULLRAM_BANK11867_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11867_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11868
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11868_DATA_W                                         32
#define RFC_ULLRAM_BANK11868_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11868_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11869
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11869_DATA_W                                         32
#define RFC_ULLRAM_BANK11869_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11869_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11870
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11870_DATA_W                                         32
#define RFC_ULLRAM_BANK11870_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11870_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11871
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11871_DATA_W                                         32
#define RFC_ULLRAM_BANK11871_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11871_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11872
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11872_DATA_W                                         32
#define RFC_ULLRAM_BANK11872_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11872_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11873
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11873_DATA_W                                         32
#define RFC_ULLRAM_BANK11873_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11873_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11874
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11874_DATA_W                                         32
#define RFC_ULLRAM_BANK11874_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11874_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11875
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11875_DATA_W                                         32
#define RFC_ULLRAM_BANK11875_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11875_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11876
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11876_DATA_W                                         32
#define RFC_ULLRAM_BANK11876_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11876_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11877
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11877_DATA_W                                         32
#define RFC_ULLRAM_BANK11877_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11877_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11878
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11878_DATA_W                                         32
#define RFC_ULLRAM_BANK11878_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11878_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11879
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11879_DATA_W                                         32
#define RFC_ULLRAM_BANK11879_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11879_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11880
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11880_DATA_W                                         32
#define RFC_ULLRAM_BANK11880_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11880_DATA_S                                          0

