zephyrproject-rtos/zephyr/ext/hal/ti/simplelink/source/ti/devices/cc13x2_cc26x2/inc/hw_rfc_ullram.h
//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11981
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11981_DATA_W                                         32
#define RFC_ULLRAM_BANK11981_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11981_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11982
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11982_DATA_W                                         32
#define RFC_ULLRAM_BANK11982_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11982_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11983
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11983_DATA_W                                         32
#define RFC_ULLRAM_BANK11983_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11983_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11984
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11984_DATA_W                                         32
#define RFC_ULLRAM_BANK11984_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11984_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11985
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11985_DATA_W                                         32
#define RFC_ULLRAM_BANK11985_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11985_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11986
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11986_DATA_W                                         32
#define RFC_ULLRAM_BANK11986_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11986_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11987
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11987_DATA_W                                         32
#define RFC_ULLRAM_BANK11987_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11987_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11988
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11988_DATA_W                                         32
#define RFC_ULLRAM_BANK11988_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11988_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11989
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11989_DATA_W                                         32
#define RFC_ULLRAM_BANK11989_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11989_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11990
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11990_DATA_W                                         32
#define RFC_ULLRAM_BANK11990_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11990_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11991
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11991_DATA_W                                         32
#define RFC_ULLRAM_BANK11991_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11991_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11992
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11992_DATA_W                                         32
#define RFC_ULLRAM_BANK11992_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11992_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11993
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11993_DATA_W                                         32
#define RFC_ULLRAM_BANK11993_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11993_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11994
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11994_DATA_W                                         32
#define RFC_ULLRAM_BANK11994_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11994_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11995
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11995_DATA_W                                         32
#define RFC_ULLRAM_BANK11995_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11995_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11996
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11996_DATA_W                                         32
#define RFC_ULLRAM_BANK11996_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11996_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11997
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11997_DATA_W                                         32
#define RFC_ULLRAM_BANK11997_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11997_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11998
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11998_DATA_W                                         32
#define RFC_ULLRAM_BANK11998_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11998_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK11999
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK11999_DATA_W                                         32
#define RFC_ULLRAM_BANK11999_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK11999_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK12000
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK12000_DATA_W                                         32
#define RFC_ULLRAM_BANK12000_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK12000_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK12001
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK12001_DATA_W                                         32
#define RFC_ULLRAM_BANK12001_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK12001_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK12002
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK12002_DATA_W                                         32
#define RFC_ULLRAM_BANK12002_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK12002_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK12003
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK12003_DATA_W                                         32
#define RFC_ULLRAM_BANK12003_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK12003_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK12004
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK12004_DATA_W                                         32
#define RFC_ULLRAM_BANK12004_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK12004_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK12005
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK12005_DATA_W                                         32
#define RFC_ULLRAM_BANK12005_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK12005_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK12006
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK12006_DATA_W                                         32
#define RFC_ULLRAM_BANK12006_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK12006_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK12007
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK12007_DATA_W                                         32
#define RFC_ULLRAM_BANK12007_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK12007_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK12008
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK12008_DATA_W                                         32
#define RFC_ULLRAM_BANK12008_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK12008_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK12009
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK12009_DATA_W                                         32
#define RFC_ULLRAM_BANK12009_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK12009_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK12010
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK12010_DATA_W                                         32
#define RFC_ULLRAM_BANK12010_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK12010_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK12011
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK12011_DATA_W                                         32
#define RFC_ULLRAM_BANK12011_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK12011_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK12012
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK12012_DATA_W                                         32
#define RFC_ULLRAM_BANK12012_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK12012_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK12013
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK12013_DATA_W                                         32
#define RFC_ULLRAM_BANK12013_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK12013_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK12014
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK12014_DATA_W                                         32
#define RFC_ULLRAM_BANK12014_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK12014_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK12015
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK12015_DATA_W                                         32
#define RFC_ULLRAM_BANK12015_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK12015_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK12016
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK12016_DATA_W                                         32
#define RFC_ULLRAM_BANK12016_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK12016_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK12017
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK12017_DATA_W                                         32
#define RFC_ULLRAM_BANK12017_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK12017_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK12018
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK12018_DATA_W                                         32
#define RFC_ULLRAM_BANK12018_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK12018_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK12019
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK12019_DATA_W                                         32
#define RFC_ULLRAM_BANK12019_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK12019_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK12020
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK12020_DATA_W                                         32
#define RFC_ULLRAM_BANK12020_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK12020_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK12021
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK12021_DATA_W                                         32
#define RFC_ULLRAM_BANK12021_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK12021_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK12022
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK12022_DATA_W                                         32
#define RFC_ULLRAM_BANK12022_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK12022_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK12023
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK12023_DATA_W                                         32
#define RFC_ULLRAM_BANK12023_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK12023_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK12024
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK12024_DATA_W                                         32
#define RFC_ULLRAM_BANK12024_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK12024_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK12025
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK12025_DATA_W                                         32
#define RFC_ULLRAM_BANK12025_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK12025_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK12026
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK12026_DATA_W                                         32
#define RFC_ULLRAM_BANK12026_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK12026_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK12027
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK12027_DATA_W                                         32
#define RFC_ULLRAM_BANK12027_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK12027_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK12028
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK12028_DATA_W                                         32
#define RFC_ULLRAM_BANK12028_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK12028_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK12029
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK12029_DATA_W                                         32
#define RFC_ULLRAM_BANK12029_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK12029_DATA_S                                          0

//*****************************************************************************
//
// Register: RFC_ULLRAM_O_BANK12030
//
//*****************************************************************************
// Field:  [31:0] DATA
//
// SRAM data
#define RFC_ULLRAM_BANK12030_DATA_W                                         32
#define RFC_ULLRAM_BANK12030_DATA_M                                 0xFFFFFFFF
#define RFC_ULLRAM_BANK12030_DATA_S                                          0

